{
    "source": "reddit",
    "feed": [
        {
            "post_title": "Blackberry A Stunning Comeback AMD Partnership And Revenue Growth.",
            "body": "Blackberry surprised the skeptics and on April 3 removed the curtains and delivered better than expected revenues beating the street estimates for Q4 FY24. The turnaround story is now a stunning comeback and revenue growth story. The estimate was 154m in revenues and BB delivered an impressive 173m  with 25% growth year over year in the IoT segment. BB is well positioned in high growth sectors with limitless opportunity especially in automotive which saw huge momentum in 2023 for example global car sales numbers were up 28% in China, the world largest car market hit 30 million cars. UK sales numbers were up 18% and the Philippines and India broke records with India reaching 4 million cars sold for the 1st time in hitory. In the US market Feb alone car sales numbers were up by a whopping 9.6% over last year same month and Ford EV traction and GM both were at record high. BB stand to benefit tremendously from automotive sector momentum particularly in China since they have brilliantly created strong strategic partnerships with top EV makers including BYD which surpassed Tesla recently as the number one EV seller in the world. Another key BB EV maker partner is Xiaomi, they launched an electric car SU7 with preorders started at 10:00pm China time. A surprise firm 30,000 orders recorded in 27 minutes. Pre-orders hit 50,000 in the 1st 24 hours. Foxconn also is another big win for BB and they are launching heir 1st EV in 2025 with Blackberry QNX inside. Taiwan based Foxconn is the make of Apple iPhone. At the Wold Imbedded Software Show in Germany Blackberry and AMD announced a strategic partnership on Robotics technology sending a shockwave in Germany and around the world. Blackberry is back in the spotlight , on  the world stage pioneering innovation in intelligent car software, robotics and so much more. Blackberry is an innovation icon, the Next Nvidia.",
            "comments": 76,
            "post_time": "2024-04-14 11:10:55",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1c3yj60/blackberry_a_stunning_comeback_amd_partnership/",
            "overall_sentiment_score": {
                "neg": 0.006911111111111111,
                "pos": 0.2978222222222222,
                "neu": 0.6952666666666666,
                "compound": 0.4734522222222222
            },
            "overall_sentiment": "bullish",
            "num_comments": 138
        },
        {
            "post_title": "NVIDIA $920 next Monday!!! (EASY)",
            "body": "https://preview.redd.it/y56zvrggueuc1.png?width=797&format=png&auto=webp&s=9e35f79d84910abf4c819fe95ef1710d115e0b8d\n\nGuys, it seems like tomorrow NVIDIA will sky rocket up, on the day of October 7th Hammas attack Nvidia only dropped 3.7% when market opened on Monday there was a further dropped (Within that 3.7%) to $444 then sky rocketed back up and yesterday market already $25, maybe pre-market dropped a little bit more on Monday then shoots up as soon as market opens (Priced in already)\n\nNo way just a few missile strikes that Isreal intercepted 99% of it would have that much more negative impact and further more those that hit was already reported to not have any substantial damage to the military base and no reported casualities as of yet\n\nhttps://preview.redd.it/rn94eq8bweuc1.png?width=847&format=png&auto=webp&s=e015594145f4169180d48a93f32ec77c579d6385\n\nFurthermore we're at the cusp of a triple high top, TOMORROW BULLS!!!\n\nTHROWING my entire life savings into calls",
            "comments": 23,
            "post_time": "2024-04-14 03:15:06",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1c3pdrr/nvidia_920_next_monday_easy/",
            "overall_sentiment_score": {
                "neg": 0.02666666666666667,
                "pos": 0.12491666666666668,
                "neu": 0.8484166666666667,
                "compound": 0.09844166666666669
            },
            "overall_sentiment": "bullish",
            "num_comments": 57
        },
        {
            "post_title": "TSLA earnings ",
            "body": "I see Tesla going either way, however I’m leaning towards the bearish side. Few statistics I found to make my decision. \n\n1- Their car delivery numbers were disappointing only delivering 386,810 cars versus analysts expected 433,371 representing a nearly 11% decrease QoQ. Even with the new cyber trucks their deliveries still plummeted, leading to a 9% drop in price. A as growing company not sure how they pulled of this of but very bearish. \n\n2- Teslas new car the Cyber truck has been incredibly underperforming and users say it’s dying way faster than it should especially when carrying large loads (what it’s designed for)\nEdit: saw this right after posting😂 \nhttps://www.reddit.com/r/wallstreetbets/s/E53YkLsAIE\n\n3- We have seen a very slow EV market recently with most companies shares falling or just collapsing as a whole. Rivian and Lucid are on their way with Lucid only being held up by Saudi funding even with billions of net loss and debt. We saw Fisker declare bankruptcy. While Tesla is still leading this sector, EV is down 37% in the last year. This leads into my next point…\n\n4- With the slow EV sector and many companies collapsing we still see a handful of companies going up and competing with Tesla. Such as Xiaomi which created a new car (comparative to teslas model 3) costing only 29,900 (nearly 10,000 less than the model 3). While Tesla reported poor sales, we saw BYD sell 300,000 cars in march versus 122,230 in January AND February. Li Auto delivered 4,400 more vehicles than its 76,000 Q1 estimate. Also EV companies have been changing the market. For example NIO announced a possibility to trade in gas cars for EV. BYD has been slashing prices and growing overseas sales. XPeng has doubled incentives on its SUV. And more. So with all these companies, succeeding why is Tesla lagging?\n\nNow of course Tesla is not totally terrible. They have been pretty innovative recently too. \n \n1- They just announced the robo taxis coming in August of 24 which would open up a whole new branch for Tesla and increase profits (if it works). This isn’t all the new tech they are unveiling. They have released the cyber truck and semi truck along with having the model 3 be around 10,000$ cheaper than an average new car right now. These tech advancements are proving valuable for Tesla. \n\n2- I think this is the biggest bullish flag for Tesla. Their near monopoly on self driving and the tech that comes with it. I rememberer driving in one a few years ago and its auto pilot could only do highways. I drove in one the other day and it could do anything. Switched lanes at a light because it was 1 car faster. They are the main company when it comes to self driving and this is due to the 22.5 billion miles Tesla cars have driven. Every one of the miles is mapped out by Tesla to train its self driving. Other companies may and have tried to replicate this self driving, and while it may be easy to make it, the training is very difficult. Tesla has this training, however somewhat lacks in the tech industry compared to companies like Nvidia. Nvidia has a self driving sector however they and all other self driving companies need Tesla. For a complete self driving AI you need 3 things: hardware, software, and data. Nvidia has the hardware, Nvidia and Tesla have software, however only Tesla has the data. This shows their monopoly on the data portion and currently domination of self driving. I expect it to stay this way for a while and if they decide to partner up with say Nvidia, it’s even more bullish. \n\n3- One more factor I think could go either way is Tesla layoffs. They just announced potential layoffs of 20% of the workforce and we saw when Meta and Google did this shareholders loved it. However if they want to make their robo taxis they need more workers. On the other hand, might replace workers with robots. Kidding but I think this could be bearish or bullish. \n\nIn conclusion I think Tesla is bearish for earnings due to deliveries and other EV companies still making it work in the poor markets while Tesla is not. However on the long term I see Tesla going back up to where it used to be as it dominates the self driving sector. What do you guys think?🤔 \n\nThis is NOT financial advice but position are 4/26 150$ put currently at 1.88. Longterm just have shares. ",
            "comments": 11,
            "post_time": "2024-04-14 20:13:27",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1c4avx7/tsla_earnings/",
            "overall_sentiment_score": {
                "neg": 0.00989090909090909,
                "pos": 0.13292727272727273,
                "neu": 0.8571757575757575,
                "compound": 0.17072151515151515
            },
            "overall_sentiment": "bullish",
            "num_comments": 20
        },
        {
            "post_title": "Tesla IS at the cusp of solving autonomous driving, and I'm tired of people dismissing this",
            "body": "\n\nhttps://preview.redd.it/cc5q6fy4qfuc1.png?width=904&format=png&auto=webp&s=afd1c9da5177fb373f2d5ab23eeabeea66580538\n\nhttps://preview.redd.it/3b5nj4a9qfuc1.png?width=908&format=png&auto=webp&s=aac7845a552d2e62ac6a45516f2c30a5025fc2a8\n\nhttps://preview.redd.it/psibbhxbrfuc1.png?width=974&format=png&auto=webp&s=ad344747b7a4aabc2ee289d790cab779268bcee5\n\nI feel obligated to post this after reading through a few threads and being shocked at the misinformation in this sub.\n\nI believe Tesla is at the cusp of solving autonomous driving. I'll go over some of the points that people are not considering/misunderstanding in the following text.\n\n\"They've been doing this for years and it's still nothing more than advanced cruise control.\" This misses a huge detail. FSD V12 is fundamentally a different architecture from all previous versions. V11 had 300k + C programming, V12 has removed all of this, shifting the approach to an end-to-end solution. This has always been the endpoint; end-to-end is scalable and easily trained, it learns by itself instead of being programmed by limited humans. Tesla is one of the biggest customers of NVIDIA's GPUs, Elon Musk tweeted a month ago (see image attached) that compute is no longer a bottleneck. You could claim Elon is just lying but the proof is in the pudding. FSD V12 has been having a steady and fast update release schedule. We are now in V12.3.4 after several updates. The fact that the software shifted to fully self-learning AI means now you just need two things: data (good diversity, non-simulated, and proprietary data) and compute. Compute doesn't seem to be a current bottleneck so let's see how the data is looking.\n\nTake a look at the image attached showing miles driven while using FSD. Data that falls under this category is important as interventions are one of the most important data types; it allows you to see the difference between what the software would've done and where the human disagrees. It's straightforward to see why this is invaluable. As you can see, this graph represents an obvious exponential growth, and it isn't slowing down in the upcoming months. Half the eligible fleet (US and Canada) still hasn't got/downloaded the free month trial. Subscription cost just lowered to $99 a month from $200. People on Twitter are overwhelmingly impressed and shocked at the quality. Whoever has the software, I ask you to give it a test drive again if you weren't impressed at first and you'll be shocked.\n\nThis amount of data coupled with the compute Tesla has, gives the company a SIGNIFICANT advantage in the pursuit of creating a generalized driving solution that is scalable. Tesla has 6 million+ vehicles collecting millions of frames of data a day. No one else has this much access to real-world relevant data, no one. Rivalling Tesla on compute is also extremely expensive, and without the data to train it, it makes no financial sense.\n\nDon't sleep on Tesla, I've never seen such a mismatch of sentiment vs technology in my life.\n\n  \nPS edited. changed 6 billion to 6 million, initial mistake was just a typo\n\n\n\n",
            "comments": 104,
            "post_time": "2024-04-14 06:26:22",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1c3seta/tesla_is_at_the_cusp_of_solving_autonomous/",
            "overall_sentiment_score": {
                "neg": 0.07684523809523809,
                "pos": 0.1483769841269841,
                "neu": 0.7744444444444444,
                "compound": 0.048926984126984124
            },
            "overall_sentiment": "bullish",
            "num_comments": 276
        }
    ],
    "items": 4,
    "ticker": "NVDA",
    "num_posts": 4
}