{
    "source": "reddit",
    "feed": [
        {
            "post_title": "Boeing - don't buy this dip",
            "body": "Nothing has changed fundamentally for BA in last month and the selling is not done yet.  I have been watching the tape for last several months and it pulls back a little bit when news is slow or when they tease something a little bit positive, but then goes back flat.  It's a buy long term, but selling has to wind down first, which won't happen till the next set of heavy news cycle from the upcoming hearings and results.  Sit on this for next month or so, but keep an eye, once it breaks out, Boeing is gonna be hitting $230 (medium term) and $350 within 12-14 months.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 21 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Thank God I bought calls recently. I was worried till I saw this post\n\nEdit: market closed and I have no idea how OP got a hold on that many human sacrifices just so he could fuck my ass",
                "I bought at 225$ after the door incident and then bought the “dip” at 205$ … and here we are![img](emote|t5_2th52|4260)",
                "Someone bought long term puts huh?",
                "Until the culture changes back towards quality control  this will only get worse. Aircraft due to design requirements have some of the lowest factor of safeties out there. Small miscalculation or loss of quality control result in large issues. Apparently the board forgot that fact",
                "I don't care I'll buy 10 shares every Friday it's below 200. I appreciate their capacity for evil which is an often overlooked fundamental.\n\nhttps://preview.redd.it/6a3thyb7qasc1.jpeg?width=1080&format=pjpg&auto=webp&s=171ea1179d58d9825fd6d589b878488ef1dfd294",
                "I don't understand why anyone would think this piece of shit is going back near its ATH (from 2019 BTW, before the first max crash). \n\nEveryone here is just trying to jump on the next rocket and they're just desperately grasping at stuff that's been beaten down. \n\nThey have never been in a worse place reputation wise and that's not changing in less than 5-10 years. Their stock price has been stagnant for 4 years.",
                "Inverse wsb and buy this dip",
                "If they recycle their panels from the ones that fall off, it’s like adding another plane for free each quota. Bullish.",
                "Wait until after fbi raid",
                "I bought at 182 but dumped when it went up to 192. I mean if you are sitting on long term calls you'll be fine.",
                "My crystal crayons say 150 can be tested\n\nhttps://preview.redd.it/gbayfuno8bsc1.png?width=1080&format=pjpg&auto=webp&s=e514615e9cb0b9888bf1dc3870d6491aed4723d3",
                "fUnDaMeNtAlLy",
                "recent boeing ceos care more about and cost cutting and the stock price than proper engineering standards and quality controls.  until that changes, they will probably keep making mistakes.",
                "\"nothing has changed\" lol they switched CEO",
                "Of course I’m buying this dip. \n\nBuying more puts.",
                "I’m still holding from 2018, only down 52%![img](emote|t5_2th52|4640)",
                "That and they murder people",
                "Bought 60 shares when it dropped to 180$ and I don't see how it could go lower than that after last time's shitstorm.",
                "A waterfall is not a dip",
                "I got in at 180. I’ll buy more any place around that. Defense contracts are not taking a hit. They are still back ordered 7 years on planes. The only option is Airbus and they are 7 years booked out. It’s a buy for me and I’ll be  adding continually.",
                "The fact that they appointed another finance person as CEO tells you all you need to know",
                "My first foray into buying a beaten down company that “has absolutely no chance of going bankrupt” got in at $205. Sold at $197. If you are tempted to buy Boeing, the make money on Boeing being beaten down play is to buy Airbus and Rolls Royce. They make planes that don’t fall out of the sky or pop apart like Lego sets in the hands of autistic eight year olds, and engines for planes that don’t fall out of the sky or pop apart like Lego sets in the hands of autistic eight year olds respectively.",
                "Boeing's new slogan \"When one door closes another opens.\"",
                "100%, anyone that even farts on a Boeing plane generates news. Negativity is just wayyy too hot.",
                "Damn I was getting ready to buy, but I’ll hold off based on some wsb poster’s feelings about what the chart looks like.",
                "Allegedly they are installing a ceo work a background in engineering... historically this is actually a great move... business majors tend to be morons",
                "The decision to buy Boeing's dip should be carefully considered in light of the company's recent challenges and the potential for a rebound. Here's a summary of the information from the sources provided:\n\n1. **Challenges Faced by Boeing:** The challenges faced by Boeing in 2023 include issues with its defense business, margin pressure, costly charges, manufacturing quality issues, and delivery delays in the commercial airplanes division. These challenges may impact the company's financial objectives and stock attractiveness, raising concerns about its medium-term outlook.\n2. **Potential Rebound Factors:** Despite the recent decline in Boeing stock, there are several potential tailwinds that could support a rebound. The recent incident involving a 737 MAX 9 jet in an Alaska Air Group flight may have caused a spike in bearish sentiment, leading to the stock's decline. However, analysts at The Goldman Sachs Group have rolled out an outlook for 2024 that favors a breakout in the United States manufacturing sector, which could benefit Boeing. Additionally, the backlog of orders in the industry is beginning to rise, indicating increasing demand.\n3. **Valuation and Market Sentiment:** The recent decline in Boeing stock may have been overdone, as 100% of all the jet orders involve either 737 MAX 8 or MAX 10 jets, and none of these orders include MAX 9 jets. This suggests that the market may be bidding up the stock in anticipation of an earnings beat. The article also discusses the valuation of Boeing and Spirit AeroSystems, noting that both stocks are being punished for the faulty MAX 9 incident, despite the majority of their revenues coming from MAX 8 and 10 models. This could indicate that the market is willing to pay a premium for these stocks, suggesting a potential turnaround.",
                "I’m on a Boeing 787 (Qatar), was scheduled to depart London Gatwick at 1455 but was delayed at the top of the runway because one engine wasn’t turning on. We were parked remote from the terminal for about an hour before it was fixed but fuck me, this just adds to the narrative that things keep going wrong.",
                "Long puts @155 expiring after next EA",
                "it's opposite day so i'm buying calls. see you regards in the welfare line, but hopefully at the lambo dealership",
                "![img](emote|t5_2th52|31224)",
                "I’ll buy at $101",
                "[Still a ways to go](https://old.reddit.com/r/wallstreetbets/comments/1924qb3/alaska_airlines_has_found_some_loose_hardware_on/kh2sr6e/?context=3). We've only seen a couple minor incidents so far - symptoms. Wait until the big one before you buy.",
                "I can’t stress that the BA investment idea doesn’t make sense to me in the near or mid term except on hopium… ceo steps down but it’s the same bean counting that cause this mess… did the new CEO say anything about fixing the alarming issues… reworking policy on innovations and safety that was the core business model… even if it did… this house was slowly being torn down… the current work culture might take half a generation or decades to rebuild…  driving profits into better workflow and less on stock buy backs?",
                "I will buy the dip when a few 777 and 787 dip",
                "Bought in January after the window thought it couldnt get worser than losing a window mid air ![img](emote|t5_2th52|4260)",
                "Yup. Still have some criminal investigations and positions recently vacated to fill.",
                "Any news on the starliner?",
                "trust me bro",
                "Whew now its time to buy.",
                "At this point they need to be bought out",
                "Lol, because markets reflect reality of the health of a business?  This post truely belongs here.",
                "bought shares rn thanks to this post 👍🏼",
                "Calls it is then",
                "I already bought and sold calls for a profit, but thanks for your post",
                "They just have some slight issues with product quality",
                "And don't sit in an exit row on a Boeing plane.",
                "I bought and sold puts.  May dip into that pond again",
                "I'm buying 🙏🏻",
                "Why wouldn’t I buy this dip? It brings my average price down if I continuously buy every time they are exposed for being run by the poor eating aristocrats.",
                "Or, take that Boeing money your holding and dump it into Airbus.",
                "Well it’s good that you’ve been watching the tape for us",
                "Too late mother trucker!!!!!!!",
                "When is the movie due out?",
                "i dont expect much until this bosses of \"profit before everything else\" are again replaced with engineers, like it was 20y ago...",
                "long put @$150, just me?",
                "That’s it, I’m all fucking in.",
                "Trying to time the perfect buy will fuck you up. Better split the purchase in multiples within your expected timeline. So when were you thinking of buying in?",
                "Thanks for letting us know!",
                "The only time I lost money on stocks was when I listen to WSB. Guess it’s time to buy.",
                "Whistleblower suicided himself",
                "Wait until Lorne Michaels' puts print first, at least.",
                "The play is to buy $SPR (Spirit Aero) on buyout hopes, then re-enter $BA after.",
                "what do you say is a good entry point?\n\ni have no POS in BA so far, but FOMOing on getting some shares or calls..",
                "There is no scenario in which Boeing avoids bankruptcy",
                "The dip only keeps dipping",
                "soooooo put and short the dip GOT IT",
                "I bought ba at 180-185. LFG regards",
                "Boeing stock was 40$ in 2012 when then company was in far better shape all told. It deserves to be back there if not lower",
                "Does anyone reD books these days?",
                "Ever see that documentary about Boeing and how it used to be about quality back in the day and how under the new CEO quality went out the window for stock price? Twas quite interesting.",
                "Anthony Blinkins 747 was grouded due to mechanical issues.  Can't wait to see what they fuck up next!",
                "Cool, calls it is!",
                "No way in hell Boeing hits 350 in the next three years",
                "lol putting out no more than 9 planes per day in march. \nLet’s see how q1 earnings go. \n!banbet",
                "Sir yes sir!!!  Random Reddit user obeyed!",
                "Boeing hasn't been profitable since 2018.  Anyone buying shares or calls deserves to lose money.",
                "But should I buy the crash?",
                "Buy Embraer instead, they are going to outperform every airplane manufacturer in the next 5 years",
                "Dollar cost average into it, easy money.",
                "Everybody who's thinking it's rising today and deluding themselves, remember a few things: 1. Dead cat bounce, 2. The market is rising I don't know where it will go day to day, but there's another hearing coming and they will take a beating when that happens.",
                "lol... BA just got a contract to do the nukes out in Utah.\n\nRIP your puts",
                "Boeing will be fine. Too big to fail. \n\n\nThey are easily one of the most heavily protected companies in the US. It doesn't matter how many planes crash.\n\n\nAnd here's a thought. How is it Boeings fault the airplanes are falling apart? They are the manufacturer, not the customer. The airlines are responsible for maintaining their aircraft, not Boeing. Not Boeings fault Delta outsources their heavy maintenance checks to some dude wearing sandals in Mumbai or wherever. ",
                "See you all the way at $100",
                "Literally just picked up 50k in BA. This post just gave me a happy little tingle",
                "I'd rather be buying Spirit Aerosystems than Boeing.\n\nBoeing will need to undo a lot of bad decisions to win confidence back:  \nMove HQ back to Washington State  \nHire an engineer CEO  \nBring manufacturing back in house",
                "pretty happy with my 100 shares at $179.  Probably going to buy more.  Too big to fail, defense contractor and splits the market for airliners.  Order book extending a decade into the future.",
                "Ok",
                "They need to go to fucking 0. Fucking scared to death every time I get on a flight cause of them.",
                "This post is my buy signal. Thanks!",
                "Selling will never wind down. Boeing will finally get dismantled and shareholders will lose it all"
            ],
            "post_time": "2024-04-03 10:44:10",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1buxeu4/boeing_dont_buy_this_dip/",
            "overall_sentiment_score": {
                "neg": 0.00375,
                "pos": 0.11058333333333333,
                "neu": 0.8856666666666667,
                "compound": 0.16638333333333336
            },
            "overall_sentiment": "bullish",
            "num_comments": 229
        },
        {
            "post_title": "I'm going to be honest.",
            "body": "&#x200B;\n\n[I've been watching the stock market for 6 years. Have I EVER won, no. Will I ever win? Yes. The day is coming I know it. Am I a full blown tard, 100&#37;. First time i've prayed in 13 years. Why have I begun this hobby? Why am I so enthralled with the market even though I lose 7\\/10 trades? The adrenaline. I'm at my 9-5 cubicle job watching BA absolutely rip. Just plugged in a second monitor to simultaneously watch Noose tying videos as I watch my account total slowly creep towards 0.](https://preview.redd.it/n6mo0havhhsc1.png?width=1473&format=png&auto=webp&s=06645c63438d27f43486982600633b09e3348bdb)",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 15 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Before I feel bad, is this option based suicide?",
                "https://preview.redd.it/x0lknljpvhsc1.jpeg?width=389&format=pjpg&auto=webp&s=8005ffc51fa8b983debf9ca6a4c501189579965b",
                "Now this is how we format posts.",
                "Must be Jim Cramer's incognito account.",
                "I resemble this post...\n\nI just love slowly dwindling away at my hard earn funds, only winning enough trades to keep me from punching my screen and yoloing on something dumb cause it's all gonna slowly trickly away anyways 😆",
                ">second monitor to watch noose tying videos\n\n\nWhat a multitasker.",
                "The more the planes drop out of the sky the more the government rewards them.  They literally murdered a whistleblower in the middle of his testimony and nothing happened.  You can't short a company that will murder you.",
                "Your puts look like a Boeing Max trying to fly",
                "GA helps a lot of people 🤷🏼‍♂️",
                "Eat some green crayons and post us in the morning.",
                "Bro at this point just buy spy",
                "post your trades so I can inverse",
                "OP have you actually never won once in 6 years? Cuz that's kinda bad my g",
                "Try 10 years 🤔",
                "I feel what you just said, deep in my loins..",
                "every day is an opportunity",
                "If you lose 7/10 trades, unless you’ve broken even the other 3 every times that makes you dirty rotten list.. this guy has WON! ",
                "key word \"watching\" ... watching the market is full time job  ... gambling on it is next level",
                "Ok guys I um just got out at 100% gains I was overreacting. Unplugging second monitor.",
                "Read A Random Walk Down Wall Street, 4th Ed",
                "Find a trend and buy some leaps here and there, dude. I've definitely lost every trade-in and out option under a month. Theta bs"
            ],
            "post_time": "2024-04-04 09:52:31",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bvqozg/im_going_to_be_honest/",
            "overall_sentiment_score": {
                "neg": 0.013846153846153847,
                "pos": 0.30864102564102563,
                "neu": 0.6775128205128205,
                "compound": 0.3414653846153846
            },
            "overall_sentiment": "bullish",
            "num_comments": 39
        },
        {
            "post_title": "CEO got $32.8 million last year to ruin Boeing.  I would’ve done it for $10 million",
            "body": "",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 312 | **Previous Best DD** | \n**Account Age** | 4 weeks | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "I wouldve done it for 5 mil, heck I wouldve done it for 4",
                "Y’all don’t know your value, which is why this dude got $33 mil and we’re posting on reddit. As a professional screw-up, I would have demanded $45 mil and done it in half the time.",
                "What does this guy actually do all day?",
                "Better yet, he made MORE since it's been going on for years.",
                "I would’ve done it simply for the love of the game",
                "Yeah but assassins payments had to come from his paychecks and bonuses",
                "Shit for $500K/year I could of responded to every safety concern email with “IDGAF SELL THE FUCKING PLANES”",
                "I woulda done it for about tree fiddy",
                "He did exactly what he was asked to do.  Pretend to care about safety and push the same short term optimizations that they have been pursuing for the last 10 years.  He wasn't paid that much to fix safety issues or improve engineering.  He was paid that much to make it *look like* they were doing something, to talk a good game, and to keep costs down.  Bonus if he could avoid meeting union demands.",
                "The company got killed in 1997 when they merged with an aerospace firm run by MBAs and financial engineers. Boeing was an engineering-driven company and they got taken over and then gutted.",
                "\"Work Smart not hard\"",
                "This is why you're an amateur and will always be an amateur.   \n\n\nCEOs fake it till they make it then they fake it some more because there's an abyss of solitude that they adorn with materialistic boons but which  they know ultimately leads to a hollow all encompassing vacuum of self-hate and maniacal perseverance which slowly eats itself like a snake consuming it's tail. This is the CEO way. This is why you fail.  \n\n\nFamily. Friends. Relationships. Ethics. Humanity.  \nThese are the 5 beasts you must conquer before true CEO-ness is achieved.  \n\n\nHe should've charged 40 million.  \n(buy my book, How To Be the Devil with Steve Allen in stores soon)",
                "I would have done it for nine bucks and a Wendy's frosty.",
                "Jokes on Boeing, I would have done it to not have to spend my nights behind the Wendy's in East Oakland.",
                "Cnn said 33.8 mill.\nCnbc said 5 mill.\nMost of ceo comps are in restricted stocks or options.",
                "Everyone on this sub: \"Shit, I'd do it for tendies\"",
                "I still don't get what this special talent is that CEOs are meant to have over us normal-wage fuckers...",
                "That guy must be prepping to short the stock but failed. \n\nDoes it even make sense? ![img](emote|t5_2th52|4267)",
                "To be fair, I’m sure it took longer than a year to erode quality and safety.",
                "But would you have been able to lie with a straight face to the media?",
                "but...how many accidents would there have been?",
                "$10 million and the IKEA door they use in their aircraft….",
                "I'd have done it just for the thrill of the hunt.\n\n\nThe Boeing Blockchain AI corporation would've dominated and we'd probably still do all the plane stuff too",
                "Sure that's easy to say but commonfolk don't understand how hard it actually is to break a company that large, that badly and that quickly IRL.",
                "I would have done it for 6.9 million and 42 cents",
                "I ruined my own company for free",
                "My university lost every football game. We played when I was there one year. The coach earned something stupid like 15 million that year. I wrote a letter to the university present, offering to lose every single gain for 10 million and got a very humorous letter back. But he didn’t offer me the job.",
                "You would’ve done it for $10M I could’ve done it for free",
                "How much did the people who died get?",
                "If I get benefits I will do it for free.",
                "Ill currently ruin the org for 1.5 M AAAaaannnd I promise , I couldnt possibly do a worse job...but then...who could????",
                "I would have done it for free.",
                "![img](emote|t5_2th52|4271)",
                "I'd do it for four million. People offering to ruin Boeing for less are ruining it for the rest of us. Seriously. You need to get paid for your work.",
                "I'd do it for $9M",
                "Not worth my time to leave my house for anything under 9.6…….million I only except gold bullion btw….",
                "Don't forget to also call out a hit on a dude",
                "I would have done it for 5 and put bungee chords on the doors",
                "He assassinated the whistleblower in clean fashion, so there’s no trace back to him. Could you have done it as cleanly? Sloppy job gets you convicted and jailed.",
                "I would do it for 1 mil. but I'd probably do a lot less damage.",
                "And how many doorless planes will you promise to deliver?",
                "Unfortunately you wouldn’t have done as good of a job parking the Max behind the Wendy’s dumpster. CEO did an amazing job of doing so.",
                "Have you told them that?  They probably weren't aware.",
                "I'd have done it for a Snickers bar.",
                "Overpaid to screw up. Bravo.",
                "But, would you have used dish soap as lubricant? For the airplane, not personal.",
                "To be fair though you’d probably have done a much more thorough job of it too.",
                "I would have done it for 3%",
                "But would you have cut the shit out of all of those corners? Dude earned it.",
                "> Boeing CEO Dave Calhoun took home $32.8 million in pay for 2023, up 45% compared with the $22.5 million earned in 2022. Last year was a good one for the company, but 2024 hasn’t started out as well.\n\nWonder what the raises for engineers was 🤔🤔🤔🤔🤔🤔",
                "I could have ruined it for $50",
                "That’s allota coin to basically say “No” to every cost improvement request! \n\nI would have CEOed for $1M… just saying, I’ve done worse for less.",
                "I would do it for 100 bucks but a full year of 737 max free rides.",
                "I won't lie, I'm not doing that job for anything less than $32.8.m",
                "I would have done it for anything over the 40k/year that I make now.",
                "I would've done for a double quarter pounder meal.",
                "That because your virgin, chad move is to offer them a deal for at least double the previous CEO.",
                "If I really had to I could totally probably fly and land an airplane in an emergency. I could also probably run a company like Boeing in an emergency.",
                "I would’ve made it better by paying Lebron, Messi, and Ye to advertise and would’ve done it for only 4 million. Easy money sniper",
                "you would've done it better",
                "If they want to run planes into the ground I could have done it for half the cost",
                "Bro I would’ve done it for a taco and a beer",
                "I would’ve done it for  1.9m.",
                "I am waiting for either the hiring of 20+ foreign doctorate candidates across various disciplines or AI to replace the out dated CEO concept.  One 🤡 doesn't make a circus.",
                "God I wish I was a CEO",
                "Would have done it for nothin’!",
                "I say this all the time. I will quarterback for the Cleveland Browns for 75k a year with a guarantee that I will win just as many championships as any other quarterback has for them. So far they have not taken me up on my offer",
                "Honest question why do companies pay CEO's this much money to do nothing but fire people and make budget cuts? Can they not get someone to do that for 1 mill a year? What's the point of losing all the rest of the money?",
                "Boeing also Epsteined an engineer. Boeing paid a hitman to deal with engineer in parking lot.",
                "But how good can you succ? Pleasing the board isn't as easy as it used to be bro",
                "[deleted]",
                "Do you guys all want to short boeing or something?",
                "Hell i would have done it for treefiddy.",
                "Oh yeah?! I would have done it for 1 million",
                "To qualify for a position to take down a billion dollars company, you must have prior experience in taking down another billion dollars company. \n\nYou bet there is plenty of successful company lining up for him to take it down. ",
                "*laughs in Jack Welch>",
                "Fuck it, I'll do it for free. Sounds like fun.",
                "I would have done it for 200k",
                "If they'd hired you and you did nothing you still would have been a better CEO.",
                "Compared to Pat Gellsinger's $180 million to ruin INTC, Calhoun is putting up rookie numbers.",
                "That is why you arent the CEO\nYou need to fuck up expensively for you to be worthy of being a CEO",
                "Give me karma so I can post my DD on healthcare. Please",
                "If you didn't apply when the job was open, STFU",
                "So puts? Calls?",
                "How many assassinations though?",
                "Must be nice huh",
                "tree fiddy, take it or leave it",
                "Boeings union is the problem",
                "I'd have done it for 1mil",
                "32.8 million to ruin a legacy, what selfish greed",
                "Would need more money given the scope of work and potential for stress-related health issues.",
                "My friends like to joke that I will pretty much do anything for a cheeseburger basket... This would fit in there pretty nicely.",
                "Dick Fuld got $470 million between 2004 and 2008 for running his firm into the ground. Their VaR must have glowed on some days like a beautiful rainbow in a Pixar movie. It is funny how VaR is still in use today, but only in combination with a 100% fail-safe stress test.",
                "It’s just a turn in the big seat to bleed the company dry nothing more",
                "Then Boeing fired him and gave him $50,000,000 severance",
                "They pay a guy like that  millions of dollars but won’t pay the workers on the floor any cost of living raise with out a strike and are looking to move the whole plant to a right to work state",
                "i would have done it for free, while i buy all the puts i can afford on it...and sell it short...",
                "What’s even crazier is all the shit that CEO did to fuck up and sabotage the manufacturing process.\n\nI worked aviation for 8 years, manufacturing for four, and the shit that CEO pushed is insane.  I’ve literally seen inspectors go ballistic if you try to sign off your own work, you could get fired for it!\n\nThis fucking idiot made it part of the manufacturing process and gave it a clever name, “Multi Processing Person”. Or some shit like that.  Dude could put in his own rivets and then inspect his own work for quality 🤡",
                "Never settle for being underpaid.  Ask for at least 40.",
                "You guys are very expensive",
                "He's getting $32.8 million when it should've been a prison sentence.",
                "If you make that much money, you should be held responsible for serious mishaps. These C level people are fucking crooks who just found themselves in these positions by knowing the right people",
                "I think 32 million is not enough that’s why his work ethic was trash 🚮",
                "50 bucks",
                "I’d have done it for $1m and unlimited airline miles for life.",
                "Best I can do is $20",
                "$1M, with the ability to also short the stock. Final offer.",
                "Hell, I would have done it for 1MM and probably would have done a better job than those chucklefucks.",
                "Amen brother!!",
                "I would've done it for free.",
                "I would’ve done it for $150k",
                "Is shorting a stock before hiring a lunatic CEO considered insider trading? Because 32.8 million sounds pretty cheap in that case if you manage to get the worst possible guy. In fact I think this actually may explain some CEO hiring decisions that I found pretty surprizing before.",
                "I would have done it for even 100k tbh and maybe do a better job too",
                "I would've done it for some free 🐔 tendies.",
                "No CEO can fix Boeing due to the whiny union workers in Washington who bitch about everything yet can’t do their jobs",
                "I'd have done it for free, just would ensure to place some puts prior.",
                "I’ll do it for a couple of 737s.",
                "What hacks me off is you can't buy Airbus on Robinhood!",
                "I’d do it for 1 million!",
                "I bought the dip, can I sell yet",
                "OP has the wrong Idea. Bid higher to get the job.\n\nI'll do it for $45 million",
                "F*ck Boeing",
                "Seriously what did he do to earn that?",
                "I would’ve done it for $60 million",
                "Boeing was fucked over long ago. Watch the doc on Netflix it explains a lot.",
                "You probably would have done a better job, too...!  I mean, how could you have done worse?  ![img](emote|t5_2th52|27189)",
                "I'd have done it for 100$ and a sloppy behind a Wendy's dumpster",
                "Puts on $BA\n\nhttps://preview.redd.it/hzmrpf6pm3tc1.jpeg?width=1125&format=pjpg&auto=webp&s=f06ef230014d631e62b918cbb7f28c13dfccc573",
                "I'll do it for 500k",
                "Run Ruin same thing",
                "They would have love that, its all about being mediocre and cost cutting.",
                "He continued it but Carson started it with building the 87 across the world. Boeing just can't deal with the quality issues that created.",
                "I would have done it for one pay period. That’s all",
                "I would have done it for just a million!",
                "and thats why ur not the CEO",
                "In fairness he had a better shot and being successful for $32M vs you were a sure shot at failure.",
                "I would've done it for Snickers",
                "Even better offer: I would’ve done it for just 1m",
                "I'd do it for $150,000",
                "[deleted]",
                "That does not include all the kick backs he got for using capital to buy back stocks instead of investing into the company.",
                "Fuck you I’ll do it for 8M.",
                "This is the type of job that robots/AI could do very well.",
                "I would have done it for $5 million just to undercut you for no reason at all lmao",
                "Guess he's set for life for fucking up a company in the short term",
                "no argument, Id have done it for a cool 5 mil. Im cheap.",
                "Yeah, but you probably wouldn’t have been able to fuck it up so badly even if you tried. That’s why he made the big bucks.",
                "Ahh yes, Boeing picks up McDonald’s Douglas and Boeing is then ran like McDonald Douglas, Shitty in every way",
                "I'd do it for 3.50",
                "I'll run Boeing into the dirt for $500 000 and a C series from Airbus.",
                "I would have done it for a 1 cent.",
                "I would have done it for $1 million.",
                "I can do it for 25k",
                "I could of done it for -$4, cant be that hard.",
                "Exactly, I can turn that 10 mill to 1billion easy... If not they can fire me...",
                "It took a lot longer than one year to make this transition. His pay package was compensation for being the scapegoat for decades of profit over quality. Still, I would've been a much cheaper scapegoat. Boeing was not ruined in just his tenure.",
                "I think a whole heck a lotta ppl would have done it for $100,000",
                "Dude should be in jail.",
                "Hiring assassins to kill whistleblowers off the books is expensive",
                "Boeing is not ruined.",
                "I would have done it for 18 an hour.",
                "I would’ve done it for 500 K",
                "You didn't go to Harvard or some other ivy....Oh, he went to Virginia tech. \n\nWhat is an accountant from holdings and fund companies doing as the head of an aeronautics company?\n\nWhy isn't it someone with an engineering or science background in the driver seat of one of the most high profile manufacturers in america? Why isn't a lifer with the company the CEO? \n\nWhat is this clown college bullshit?",
                "It's not ruined enough.",
                "Its the perfect jobs for AI to replace - the C-Suite.",
                "I would have saved it for $32.8 mil, by only taking 10 mil and paying the goddamn engineers and project managers who do the actual fucking work the rest of the 22.8 mil",
                "About tree fiddy",
                "I'd done it for a #10",
                "9 million",
                "How do y’all live with yourselves? I can’t. - just overall. No plans jump off a bridge?",
                "Yeah, he continued it but Carson started it with building the 87 across the world. Boeing just can't deal with the quality issues that created.",
                "Not even 1 billion is enough to associate my name with that company. CEO entire family deserves eggs thrown at them every time they’re in public just for association. I certainly wouldn’t want to deal with people like me if I was that ceo.",
                "Damn you cheap.",
                "Boeing has been a shit company for years and in 2017 didn't want competition from a much smaller sized Jet which doesn't even directly compete with the current models, made in Canada. So within the same continent and part of the same free trade bloc. Trump listened to Boeing and slapped insane tariffs on it. Then Boeing lost the case because their bullshit was all unfounded.\n\nhttps://www.seattletimes.com/business/boeing-aerospace/trade-panel-rejects-boeings-case-against-bombardier/",
                "9.9",
                "Not true. Entirely. In your version Boeing would have $22.8 million more.",
                "That’s peas compared to his short gains",
                "i would have done it for $100mil in 1 day, flee to china and told them about all the plans and get more from them.",
                "Copy paste article?",
                "Hire 32.8 people on $1m per year instead? I don’t believe you get people of any significantly better ‘quality’ once you go over high 6 figures.",
                "[deleted]",
                "CEO pay is insane.",
                "OK, now that everyone understands how shit of a company Boeing is, even when piles of cash are being shoved up its ass can we stop pretending the federal government is capable of anything except making money disappear up its ass.",
                "CEOs of large corporations are so fucking disgusting. Taking multimillion dollar bonuses every year while talking about needing to \"cut costs\" aka lay off 200 people instead of sacrificing their bonus",
                "The higher your wage the more you ruin it.",
                "What the fuck did you just say about Boeing, you little shit? I'll have you know Boeing graduated top of its class in the aerospace industry. It's been involved in over 300 successful aircraft designs, with over 100 years of experience. Boeing is trained in cutting-edge technology and is the top manufacturer of commercial and military aircraft worldwide. You're just another target market to Boeing. With precision, it will outperform you in over seven hundred ways, and that's just with its current lineup. Boeing will use its extensive expertise to wipe your competition off the face of the continent. You may have thought your comment was clever, but now you're paying the price. Boeing will shit fury all over you, and you'll be grounded for sure.",
                "No u couldn’t. Since u can’t even make $10M"
            ],
            "post_time": "2024-04-05 16:18:16",
            "post_url": "https://www.barrons.com/articles/boeing-ceo-pay-raise-2023-b4948772",
            "overall_sentiment_score": {
                "neg": 0.10733333333333334,
                "pos": 0.10566666666666667,
                "neu": 0.4536666666666667,
                "compound": -0.039816666666666646
            },
            "overall_sentiment": "bearish",
            "num_comments": 494
        },
        {
            "post_title": "A Boeing 737 Southwest Airlines had to Make a Emergency Landing after parts of the Engine Cowling Detaches",
            "body": "",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 102 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Boeing have got real issues.   Not because of this.  This type of thing isn’t that rare.  But everything that is slightly safety related is being reported all over the show.  Their reputation is in the gutter, and every single incident is dragging it further down.",
                "Is this the kinda thing that always happens, but only makes the news due to recent events?",
                "Still got no balls to short BA... ![img](emote|t5_2th52|4260) Maybe when one of the plane exploded in mid-air... It will be bearish enough",
                "Aircraft maintenance mistake, probably nothing to do with boeing. Source, i am an aircraft tech, thrust me bro",
                "Just a south west issue this time ![img](emote|t5_2th52|4271)",
                "Boeing CALLs on Monday",
                "This isn't the max, this is the 737-800 thats part of the NG family which preceded the max. They've been flying around safely for years. \nThis isnt even the fault of the maintenance department at Southwest. This was due to a bird strike.",
                "This is getting out of hand",
                "Media wants engagement. Whatever story is in vogue you hear about it every day. Remember when it was police brutality news every single day? Not that this doesn’t happen, but media chooses to amplify things that would not usually be reported. There are no more maintenance issues today than in the past. if you’ve clicked on Boeing news you’re going to get flooded with “issues” because it gets engagement from you.",
                "“Just a United Airlines, I mean Alaska Airlines, I mean Southwest Airlines Issue. Not a Boeing Issue”\n\n“guh”",
                "If it’s Boeing I ain’t going lol",
                "737-800 is an older tried and true model of 737. No one will care about this.",
                "The plane was delivered in 2017..  do you think Ford would be responsible for a hood coming off on an F-150 they sold in 2017??  Do you think the engine cover has not been removed and inspected hundreds of times since 2017?  This is a Southwest problem, not Boeing.",
                "Not a Boeing issue!!  It’s either airline maintenance or the engine manufacturer.  Some of these posts about Boeing are really ill informed.",
                "737 800 plane here. \n\nThis is affecting airlines like southwest and united a lot more than boeing. The 800 series was released in 1994-1997.\n\nWe nearing the supposed end life of these planes. Maintenence is on southwest and other airlines to maintain the plane is safe to fly, and is properly maintained. \n\nI'd be worried for boeing if this was the max series plane again.",
                "Spirit is the safest airline",
                "I have 121 shares @$151.42.\n\nPlan to add one share a day until I have 200 shares, may keep adding if it is still priced low.\n\nI just don’t see Boeing failing, or the share price staying depressed for multiple years. \n\nIt’s not like they have a ton of competition.",
                "The past two paychecks have been going straight to Boeing. I think I'm going to keep buying the dip. ![img](emote|t5_2th52|18630)",
                "How much is boeings fault versus the airlines that operate and maintain them?\n\nHonest q.",
                "Man, people gotta stop thinking these are Boeing issues. Nah, these are mechanical and inspection issues that the company who owns the planes aren't doing correctly.",
                "Obviously calls are the play.",
                "There’s a huge chance you’ve been on a plane and had some type of part failure and just weren’t told about it . Planes usually have multiple systems that control each vital part so that if one fails it dosnt crash.",
                "This is the fault of a bad southwest mechanic not Boeings fault",
                "Nothing to do with Boeing. Pre flight maintenance mistake. Stop posting this BS.",
                "now this is pod racing",
                "It’s like the city of Lud around here lately",
                "Didn’t earn it strikes again!",
                "But did shareholders make more money?",
                "And this is why you ALWAYS inspect engine cowling latches prior to signing off a plane as safe for flight.",
                "Have these things been equally common all along, but never reported so widely?\n\nOr have they recently started having loads of problems?\n\nI hope it’s always been like this, but just underreported. \n\n\nI don’t know. But I have 2 trips in the works and I am scared to fly with them.",
                "This shit is old. Plus this could be airlines fault for not completely close fan cow.",
                "I was on a Boeing earlier this week and they maintenance staff were turning it off and on trying to reset it while we were all loaded. I noped the fuck off\n\nPuts on Boeing",
                "Possibly they attached by some drug addict in the middle of his daily overdoses in the Boeing factory toilets.",
                "Op were you riding",
                "First buy TSLA, then buy Boeing. Then swoop right in and use the rest of your money for Wendy's.",
                "That's what happens when politicians start taking tons of money from corporate America , Nikki Haley should be investigated as well 🙄",
                "If that engine has been worked on recently then it’s a Southwest issue. If I have a car, open the hood to do some maintenance and then fail to close and secure the hood and it flys open while driving that’s on me or my mechanic.",
                "If it's not Boeing's fault, why doesn't this happen to Airbus? Or are mechanics on Airbus planes just that much better ![img](emote|t5_2th52|4267)",
                "The bad news on Boeing just doesn't stop. I don't want to fly in their planes again . I hope they get their shit together soon.",
                "Come on! I have seen pictures. It'll buff out. No safety concern at all. \nIt passed Boeing's inspection process. \nAll good!",
                "Bet BA goes up 6% by weeks end",
                "Was this the company that bought that worse company and now is like, exponentially worse?",
                "LOL, fkn I gamble enough I don’t want to roll the dice if im traveling.",
                "I have no skin in Boeing besides living in the puget sound. Fuck Boeing, I want to see it burn.",
                "Some of these “events” are relatively normal and without the lens being so focused on airlines and Boeing no one would have known about them.",
                "wtf is happening with Boeing",
                "This is an old plane, but I'm still wondering why decades after the McDonnell Douglas merger Boeing's newer products are only falling apart now?",
                "Boeing doesn’t make engines and airline maintenance is responsible for this. Extra regarded here",
                "Great ad placement.\n\nhttps://preview.redd.it/3q5c6yk3w4tc1.png?width=1080&format=pjpg&auto=webp&s=f1101522374025acfd4ab59a5b44f95bbe420f59",
                "going back to 180-178$ this week",
                "Fuck Boeing. Their new slogan is henceforth, \n\n*If it's Boeing,  I ain't going*",
                "No one cares. Bullish",
                "As long as the front doesn't fall off...",
                "Why does no one report the entire facts of the situation rather than blame Boeing? The plane was put in service in 2015. How many Southwest mechanics worked in these parts since being in service. Reuters article said \"The plane entered service in June 2015, according to FAA records. Boeing referred questions to Southwest.\"",
                "Shyeeeeeeet….",
                "!remindme tomorrow",
                "If it’s a Boeing I ain’t going",
                "Do you know that that’s a common problem with every plane. Things don’t work sometimes. Think of it like a UPS Or FedEx truck have a flat tire on the road",
                "Speed holes.",
                "much safe such wow!",
                "Should I buy puts or call?",
                "Buy calls for earnings",
                "Isn’t this more likely a maintenance issue on SouthWest?",
                "Who here is old enough to remember the last  time the nation’s attention was on loose Cowlings? Don’t squeeze the juice 🍊",
                "I took an Airbus a370 or something back from Frankfurt.....it was epic. Boeing is toast.",
                "Keep it going. Puts are up 40%",
                "I swear to God I'm clapping next time I'm on a Boeing airplane that lands safely ![img](emote|t5_2th52|8883)",
                "Nothing wrong with that,just like a snake these advanced jet engines shed their out skin at a specific hour mark.What seems to have happened here is that some inexperienced engine tech replaced the original cowling bolts with new ones which meant when the cowling had reached end of service time the new bolts were at their half life point so they did not break off with the cowling.                            IDIOTS……..",
                "Already priced in, their planes are apparently made of paper mache",
                "As I understand it, the loss of an engine cowling wouldn't really impact the flight. The engines are designed to survive bird strikes after all and survive/fly on one engine. However, the violent loss of the cowling as seen in the video is a big problem for everyone else around the plane, in the form of debris to the people below or debris on the tarmack which can impact a take off or landing and could lead to catastrophic results in the event of an encounter.\n\nWhich is why it's very bad when it happens.",
                "Boeing is rising on Monday, honey badger don't care.",
                "It's almost as if they don't realize they're under the microscope.",
                "At least I can look forward to Wait Wait Don’t Tell Me next weekend.",
                "so more BA putz?",
                "Call",
                "Did this plane actually take off?",
                "Honestly I don't want to see anything on \"X\"",
                "They built them so shitty they are just waiting to see what breaks so they can fix the rest. They are beta testing on the population to perfect their war machines.",
                "This makes me feel great about my flight to Costa Rica next month 😬",
                "Quality control in a product that without it causes mass death seems paramount.  But I’m no accountant.  ",
                "After Boeing killed a bunch of people on the 737 max - they made profit. So, calls…?",
                "Jesus Christ",
                "I have to get on over a half a dozen boeing flights in the next 10 days I would buy puts on my life expectancy if I could",
                "Boeing Safety Inverse (BSI) looks like a solid investment more and more each day!\n\n[BSI](https://dexscreener.com/solana/9og1k6momztamtwqe5gkbzzbg8ugpvfqnb4dgsbznlfd)",
                "Oh boy, here we go again..",
                "At this point I'm starting to think unions are sabotaging Boeing planes. It's just getting annoying AF to see maintenance issues make Reddit constantly. I'm sure the commies at r/workreform are out and about with their multi-accounts posting this.",
                "PUTS BA",
                "omg",
                "Made the Boeing Safety Inverse coin just for this reason. Time we make it known we aren’t letting them sweep these under the rug. \nSuper low market cap too, so big upside. Once we grow the market cap they won’t be able to turn a blind eye.",
                "When it goes down to $120 then it’s a buy",
                "This is why I made the Boeing Safety Inverse coin. They’ve made it clear they don’t care about our safety. They brush these incidents under the rug, sweep under the rug anyone who opposes them. \nIt’s time we show them we won’t let them get away with it, and that we do notice, and care. \nThis coin is super low market cap, but we can grow it to a point that they can’t turn a blind eye.",
                "40 percent dunk BA by Friday",
                "boeing mooning tmr",
                "It’s a good thing batman did not have this problem.",
                "“I like the stock” and love the fact that the media is doing its part in keeping it cheap for a bit till they get tired of it. I’m a patient investor 🙃",
                "That part is just for looks anyway.",
                "I thought I bought the bottom last time. Guess I’ll roll my leap after the news settles the price down further over the next few days 😂",
                "Let me buy some more puts and watch the stock rise again.  😑",
                "Oh wait..... There's more ! 🫠🫠\n\nhttps://nypost.com/2024/04/07/us-news/harrowing-video-shows-engine-of-southwest-airlines-boeing-737-ripping-apart-on-takeoff/",
                "silver to the moon",
                "not going to read thru that, lest it is a max, kid me not.",
                "Crazy idea, lets get some spanners and just check all the bolts on all the planes. Maybe add a few screwdrivers, but make sure we don't strip anything. It seems like this is the main problem. Functionally, Boeing planes seem fine, they just need to tighten things up to specs so they don't leave a sky trail of pieces falling off. Look out below!",
                "Has anybody died in the last year? \nBuying opportunity you lucky f**ks",
                "Just means more free RnD, stock is guaranteed to go up",
                "Tilray for me this week",
                "This sounds like a maintenance issue (like the wheel falling off the plane at takeoff in San Fran) more so than a design issue.  Boeing has over 50% market share and there are ten thousands of planes.  So if poorly maintained, things happen",
                "If Boeing were not shuttling for the US military their stock would be worth $2 by now",
                "The plane didn't have a filangie",
                "This is a maintenance issue (eg they didn’t properly latch the cowling) or they hit something.    In The ATC recording the pilot says they think they had a bird strike.  \n\nIIRC they said they thought either a flap or slat was damaged and did a no flap landing.",
                "Be careful with Boeing puts, no matter the amount of bad news, they are still the US’s primary contractor for military planes. If it gets too bad, they will be bailed out in the interest of national security.\n\nBear Short term.\n\nBull/ Flat long term",
                "Really cool seeing stuff like this days before my first flight in probably 20 years 🙃",
                "Time to do the FOD walk, to protect the rest of the planes coming to or leaving the airport.",
                "I made puts and BA is still up ![img](emote|t5_2th52|4271)",
                "Better video here [https://www.reddit.com/r/SweatyPalms/s/gICZKn4nYw](https://www.reddit.com/r/SweatyPalms/s/gICZKn4nYw)\n\nERJ longs are printing ![img](emote|t5_2th52|4271)",
                "This plane has been in operation since June 2015.",
                "You know that the game is rigged when boeing planes are dropping out of the sky, They're killing whistle blowers, and still winning government contracts",
                "Are all the Boeing 737s self-destructing in 2024?",
                "Wow Boeing have really gone down hill since useless ceos only want a bonus and executive team shows that these ceos and boards are mainly useless now in every company",
                "I read this plane has been flying since 2015. I doubt this is Boeing’s fault. It’s more likely the SW mechanic forgot to latch something, or just bad maintenance practices. Boeing has screwed the pooch but it feels like the media is just grasping for anything to sling mud at them now. Maybe some big fish are trying to drive the stock price down so they can buy it up cheap.",
                "![img](emote|t5_2th52|31226)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27189)",
                "Booked a flight last week and for the first time in my fucking life I actually checked to make sure it's Airbus. *If it's Boeing, I ain't going.*",
                "MOAR diversity hires MOAAAAARRRRR",
                "Lol",
                "They too big to fail",
                "Boeing killed a guy to hide how fucking negligent they are.",
                "I think Boeing stocks need to crash, and the company all together needs to fail. They just assassinated a whistle blower. I say Fuck em for killing someone who wanted to report on quality control.",
                "If it's a Boeing, I ain't going!",
                "All this constant coverage is a good thing for Boeing in that they may finally get their shit together. ![img](emote|t5_2th52|12787)",
                "Does the FAA have the personnel to keep up with these weekly occurrences? They’ve gotta be pulling some OT trying to keep up with everything that’s happened in the last four months.",
                "To everyone saying this isn’t Boeing’s fault, this is 100% their fault. 100%",
                "Recently sat in a few 737-8 crafts. I really feel afraid during take offs and the plane seems to have balance and stability issues. Landing is very similar. Cruising altitudes seems ok but don’t feel confident sitting in one where there might be heavy turbulence. Something needs to be done with these Boeing planes. Some more serious accidents are likely to happen.",
                "Annnddddd the stok goes UP ??^$#₩TF",
                "This is what happens when a public company is doing everything in the name of profits. More things like this expected in the future from many companies imo.",
                "BOEING WHISTLE BLOWER ASSASSINATED \n\nhttps://fortune.com/2024/03/13/boeing-whistleblower-death-john-barnett/\n\nLet that sink in",
                "Boeing just can't catch a break, can they",
                "Glad I’m about to get on a 737 max and united just delayed my flight by 30 minutes because “Pilots have not had adequate rest..” \n\nThis whole industry is playing with fire man.",
                "i've seen mabye a couple of such airplane disaster prior to 2020 and now its seems like it happens every month what the fuck boeing",
                "Who gets “suicided” for this one?",
                "Jesus Christ.  This company has no business existing.",
                "All these planes falling apart makes want to request all my flight be on older planes.",
                "I just flew to Scotland and on the way BOTH iceland Air Boeing 737s had to pull back into the gate to fix something that's was wrong.",
                "People are gonna stop getting on Boeing aircraft real soon.",
                "all of these planes are falling apart in front of our eyes, ive stopped flying southwest"
            ],
            "post_time": "2024-04-07 13:26:05",
            "post_url": "https://x.com/rawsalerts/status/1777017207366520949",
            "overall_sentiment_score": {
                "neg": 0.044333333333333336,
                "pos": 0.10566666666666667,
                "neu": 0.5166666666666667,
                "compound": 0.028216666666666685
            },
            "overall_sentiment": "bullish",
            "num_comments": 446
        },
        {
            "post_title": "So apparently if you want the Boeing CEO to develop safe airplanes, it has to be worded into their contract… and it costs more",
            "body": "🤦‍♂️ ",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 400 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Company filings show Calhoun made a bit less than $100 million between 2020 and 2023 running the company. Boeing stock was at about $330 a share when he took over; shares closed at $183.14 on Friday.",
                "What Boeing needs is a Quality Assurance organization that is a separate entity from their Manufacturing departments, and is entrenched with subtier suppliers. Accept crap, get crap.",
                "I being a degen floor worker for the big B concur with all said there are lot's of people here below management level that care and take pride in our work and have wanted a change for along time.",
                "God I hate Boeing so much. Oh really designing a new airplane is expensive??? How about rather than be an airplane company and make a new airplane, lets bend over backwards and squeeze every bit of life outta the 737 that was designed in the 60s. And along the way we will create so many problems that making a new airplane woulda been easy but now we are in way to deep with the 737 and have a fucking max 10 on its way. Good thing the airline industry would grind to a halt if closed our doors because otherwise we would be fucked. Never have we seen a company run by such fucking frat boy douche bag losers as this one. Jfc.",
                "They found out the last $ba ceo was in on the cover up after first 737max crash blaming pilots and then again on 2nd  crash. Chairman of board gave him $60million exit package.  Oh, and then chairman became ceo himself.  Classy leader of classy organization",
                "If it’s Boeing, we aint going. ✌🏽",
                "Did you see his bonus and severance package numbers!?",
                "Aren't like all commercial jets Boeing? Is it safe to fly with your family at this point?",
                "Imagine having a $13.25M performance bonus based on implementing a survey lol\n\n> Part of one goal includes the “design and deployment of an employee culture survey,”",
                "safeR \n\nI think you're missing an \"R\" there.",
                "After economy, there is now \"take a chance\" class.",
                "CEO pay should be 100% performance based.",
                "Typical lawyer scum. Boeing is a law company, not engineering.",
                "When did safety become optional?",
                "So is that story written by a guy name Al Root (Albert Root) or AI Root (Artifical Intellegnce  Root)?",
                "They moved their factories to cheap labour .. nuff said.",
                "\"Beginning in 2022, the aircraft manufacturer changed its incentive plan from giving executives bonuses based on passenger safety, employee safety, and quality to rewarding them if they hit climate and DEI targets, according to the filing.\"\n\nNY Post, but do your own diligence.\n\n[https://nypost.com/2024/01/11/business/elon-musk-rips-boeing-they-prioritized-dei-over-safety/](https://nypost.com/2024/01/11/business/elon-musk-rips-boeing-they-prioritized-dei-over-safety/)",
                "[BSI](https://dexscreener.com/solana/9og1k6momztamtwqe5gkbzzbg8ugpvfqnb4dgsbznlfd)\n\nTime to fight back and invest into the Boeing safety inverse!",
                "I'm all about making money, but I'd quite like to have a plane that doesn't fall apart when I have to fly. Ffs.",
                "Citizen Kane lol",
                "show us your puts.",
                "U humans and your screeches for safety are getting in the way of *big* cash PAYOFFS",
                "the CEO isn't the king and still answers to the board who has to agree to the major decisions like stock buybacks. this was the board's fault more than the CEO's",
                "\"Yeah we need one of those 777's\"\n\n\"No problem, that'll be $320 million\"\n\n\"Uh... can we get the version that doesn't just crash and kill everyone?\"\n\n\"Oh.... yeah that'll be $400 million\"",
                "I'm just jaw dropped at how their stock is acting like a stablecoin when faced with these back to back cataclysms",
                "What the… may be the contract need to say that it should remain as one piece, all the bolts have to be fastened.. aircraft has to fly but engine covers shouldn’t… ridiculous.. they need to be driven by highest quality standards.. a single mistake is going to kill many people.. they can’t cut corners like other companies do.. it is time they focus on their customers and not on the stock price.. stock price will take care of itself once Boeing delivers better/best quality products",
                "more business for Airbus i guess.",
                "Boeing spending more on safety (=higher cost) means that either they have to start selling on lower margin or increase the prices, making them less competitive compared to airbus.\nIn either case, as far as the airplane division is concerned, the outlook is no that promising. Calls it is.",
                "Sounds like Elon needs to get that added to his contract too. The ketamine and Twitter take up too much of his time and Tesla has suffered",
                "The article doesn’t really match what the regard put as a title.  Are they restructuring his comp to align against different metrics? Yes.  Do companies do that all the time as the board sets new direction for the company?  Also yes.",
                "Boeing ain’t going. In Airbus we bust 🥵. But seriously can China please make airplanes for us and just slap a USA sticker on it",
                "Gives you an example of what the risk premium should look like and not the pearl diving style we have here for much lees.",
                "Airbus will soon have a monopoly.",
                "Same as diablo 4 Ptr. Bitch about it.",
                "So Air travel in the US is going the way of health insurance...got it.",
                "Should we care/be concerned that Pratt and Whitney would rather give Spirit airlines contract credits of over $120M rather than be exposed to civil liability? Is it a bailout or a well disguised get out of jail free card?",
                "Toyota needs to get in the aircraft game.",
                "Unpopular opinion here but the safety and reliability of their products doesn't seem like the CEOs job outside of making it clear that its a priority and ensuring there is someone appointed to deal with it at an executive level, or close. Day to day stuff should be taken care of by engineering and manufacturing. I work for one of the other large defense contractors and if I had to go all the way up to the CEO's level to get someone to take safety seriously I'd quit. Plus I don't expect a CEO to have the technical skillset to know what is and isn't safe, most of them are focused on the business side.",
                "This is why I made the Boeing Safety Inverse coin. They’ve made it clear they don’t care about our safety. They brush these incidents under the rug, sweep under the rug anyone who opposes them. \nIt’s time we show them we won’t let them get away with it, and that we do notice, and care. \nThis coin is super low market cap, but we can grow it to a point that they can’t turn a blind eye.",
                "The most fucked up thing about this is that they don’t even use the airliners they are in charge of/manufacture. They fly private jets who actually care about their product being safe.",
                "This is why we just need to ***** them in the fucking ****"
            ],
            "post_time": "2024-04-07 16:45:44",
            "post_url": "https://www.msn.com/en-us/money/companies/boeing-adds-safety-goals-for-ceo-after-record-2023-pay/ar-BB1l99vP",
            "overall_sentiment_score": {
                "neg": 0.0,
                "pos": 0.159,
                "neu": 0.8409999999999999,
                "compound": 0.32011666666666666
            },
            "overall_sentiment": "bullish",
            "num_comments": 175
        },
        {
            "post_title": "Boeing wins $405M to test nuclear missile systems in 'extreme environments' in Utah",
            "body": "https://www.ksl.com/article/50969039/boeing-wins-405m-to-test-nuclear-missile-systems-in-extreme-environments-in-utah\n\nThis was announced late yesterday.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 58 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Puts on Mormons\n\n![img](emote|t5_2th52|27421)",
                "finally, something boeing can actually do, blow shit up.",
                "What happens when the door falls off a nuke?",
                "A company that is spoon fed billions of federal dollars with a balance sheet that could be written in crayons.  I am not surprised to see it here.",
                "The same Boeing that can keep their planes from falling apart...midair??",
                "Boeing shouldn’t be allowed to tie their own shoes without supervision",
                "How the fuck are they allowed to handle nukes and they can't install a panel in aircraft correctly.",
                "If you don't succeed the first time, maybe the US Govt. will give you a second chance:\n\n*A* ***Boeing*** *B-52 Stratofortress carrying two 3.8-megaton Mark 39 nuclear bombs broke up in mid-air, dropping its nuclear payload in the process near Goldsboro, North Carolina, United States, on 24 January 1961*. ([Source](https://en.wikipedia.org/wiki/1961_Goldsboro_B-52_crash))",
                "Government pity fuck",
                "0 impact. Priced in.",
                "This really isn’t some big news story. This is pennies in the DOD world. They release 10+ of these contracts a day. Not to mention that Boeing was the original contractor for the Minuteman weapon system dating back to the 70s. So for over 50 years they’ve been the only prime contractor capable to work components of the Minuteman, hence the non-competitive award",
                "Fuk",
                "Gentlemen.... it's been an honor o7",
                "Lets hope their bolts aint loose",
                "What is “the most extreme environments”? My first thought, space.",
                "Hey guys, keep in mind that while it's the same company, Boeing commercial and Boeing defense are run in separate groups.  \n\nVery different environments.",
                "People forget Boeing doesn’t really play when it comes to military. This is the same Boeing that had produced and produces the most reliable bombers in military history.",
                "Puts on Utah",
                "https://preview.redd.it/2synobiwhdsc1.jpeg?width=2000&format=pjpg&auto=webp&s=cf42d08b8ad698cbb466a798992a3e1c96f7141d",
                "Calls! No doors on a missile. Purpose of the object is to crash. They’ve missed their true calling until now.",
                "Broken Arrow",
                "No Oppenheimer memes here yet? Ok I’ll start.\n\nAre you saying that there's a chance that when Boeing pushes the button... they destroy the world?\n\nThe chances are near zero...\n\nNear zero?\n\nWhat do you want from theory alone?\n\nZero would be nice!",
                "But I live in Utah...",
                "![img](emote|t5_2th52|4267)",
                "Peanuts",
                "“Boeing attaches nuke to Boeing plane and nuke fell from the sky, blowing up 1/3 of Seattle”",
                "great, now we're gonna have panels falling off our nukes.  gonna make us look like bitches.",
                "![img](emote|t5_2th52|4640)",
                "What extreme environments are in utah?",
                "Lowest bidder always wins ![img](emote|t5_2th52|4271)",
                "Oh no...",
                "No door panels in missiles I guess.",
                "Check out Annie Jacobson’s new book on nuclear war.  It tells the story of what would happen if the North Koreans attempted a decapitation strike on the US.\n\nOne of the systems she mentions was a ballistic missile interceptor that failed 100% of its test interceptions during the trial phase.\n\nFucking terrifying book that is that much more terrifying for anyone who has worked in or with federal governments because you realize how realistic it is.\n\nA nuke over DC, one targeting a nuclear reactor in SoCal and then the retaliatory strike flying over the North Pole is interpreted as an attack on Russia so Putin empties all his silos assuming the US is carrying out a regime change attack on him.",
                "Oh lovely. They cut costs so badly that their planes fall out of the air, so I can't wait to see what wondrous activities will arise from doing thius with nuclear technology.",
                "Haha, my dyslexia read “Ukraine” and I was surprised that they hadn’t been already?",
                "the sound the missile is gonna make when it hits is 'BOEINGGG!!!'",
                "So can’t keep a plane together but let’s give them a nuke contract lol Great idea.",
                "r/saltlakecity As if the desiccating lake wasn’t reason enough to move, now this.",
                "Well Utah is fucked. Puts on poor white people I guess",
                "I bet this project isnt going to meet diversity quotas",
                "im worried",
                "Are they going to put the system on one of their planes to test it in extreme environments?",
                "Is this why gold keeps pumping? The end is near",
                "What could go wrong?",
                "It’ll be easier to blame the end of the world on Boeing after their recent plane malfunctions",
                "I mean they are really great nowadays at bringing things down. So makes sense 😂",
                "“Boeing wins $405 million to nuke Utah” \nWell that’s really doing us a favor, so Boeing to $400 by end of year.",
                "They are certainly good at crashing shit into the ground, so that's a start",
                "We are going to have one of the worst nuclear disaster in history",
                "So, nuclear disaster in Utah then.",
                "LMAO my puts are fucked.",
                "The same guys that forget to bolt in doors on planes and run faulty systems that force planes to dive into the ground?   We're now going to let them play with nuclear missiles?",
                " I hope they don’t forget to put the screws in place",
                "If their safety checks are anything like their Max planes. Just say good bye to Utah.",
                "Yeah.... I feel real confident letting Boeing test nuclear missiles right about now..... jfc....",
                "“This is how the world ends. Not with a bang, but with a whimper”\n\n\n_sees Boeing gets nuke contract_\n\n\n“Ohhhh shiiiiii-“",
                "What could possibly go wrong?",
                "That nuke is gonna explode in transit isn’t it? Puts on whoever they hire to transport their “missile system”",
                "Utah gone",
                "We’re fucked.",
                "!banbet",
                "There are no doors so should be good.",
                "Was Elon too busy or something?",
                "Please don't forget the bolts",
                "Not investment worthy news.  5 year contract that potentially pays $100M-ish per year which is negligible versus the roughly $70B-ish in revenue BA makes already per year.",
                "I thought we didn’t do nuclear tests anymore?",
                "So, what company insures the entire state of Utah?",
                "🤣 good joke! No need to test, we know it will fail!",
                "They finally found a use for their shitty planes - just add a nuke",
                "Boeing is a military powerhouse, especially with F-15EX Eagle II production for example",
                "Good thing nuclear missile systems don't have doors. This might actually go well.",
                "to test things that explode, B is the best",
                "Why the fuck would ANYONE trust BOEING with nuclear missile testing?\n\nThat’s ridiculous. ",
                "Mfs cant even make a plane reach a destination without failure… who tf giving them money to fly nukes? Lmao wutt",
                "Did they bolt the door on?",
                "Great now this time we’re all gonna die when Boeing fucks up again",
                "What are they going to do, load nukes into Boeing 737 Max’s and 787 Dreamliners?",
                "Did they declare an emergency in Utah and surrounding states?",
                "Boeing: We can't build a plane which won't fall apart...\n\nUS Government: Want to test nuclear missile systems?\n\nhttps://preview.redd.it/sswq7x3yvfsc1.jpeg?width=666&format=pjpg&auto=webp&s=99dca8f01a31fecab53312a5ca6988c136b2b0fd",
                "Nukes will be falling of those missiles causing friendly fire. Puts on everything?",
                "Didn't they just pay millions to a hitman to Epstein an Engineer that knew too much wrongdoings of Boeing?",
                "Hope it works better than their planes are doing at the moment.",
                "I hope they ensure the hatch door closes properly.",
                "Not exactly related but this is my Boeing story.\n\nSome years ago I was on a NASA contract, Boeing  was the prime. We were dragged into various initiatives aimed at improving quality. One of the examples they used was that Airbus planes were built with tighter quality and precision than Boeing planes. I was surprised that they admitted it. And seemingly they still suffer from this.",
                "Guys did you check out $BUL on Solana? It went from 100K to 8 millions market cap in less than 24 hours",
                "Wait, wait, wait, they can't even get a door to stay on a plane and we're trusting them with literal nuclear weapons?",
                "As long as they don’t have a door or wheels, should be good",
                "Boeing to potential whistle-blowers: We can nuke you",
                "Murder your whistle-blower, win a govt contract. 🇺🇸",
                "this is gonna shake a lot of beds.",
                "> The contract was first awarded in September 2017, for $154 million. In February, it was extended for another five years, making the total amount of the contract worth up to $559 million and allowing Boeing engineers to continue working at the Little Mountain Test Facility, a remote 1,000-acre area on the western shore of the Great Salt Lake. The site is owned by the Air Force and operated in partnership with defense contractors.\n\nThis sub honestly cannot read. Puts on schools",
                "They are good are blowing up planes so maybe that experience will help them.",
                "I’m just curious how we are going “to better understand \"radiation effects, electromagnetic effects, shock and vibration,\" and other environmental impacts” without actually detonating a nuclear payload? cause I’m pretty sure the nuclear non-proliferation treaty that we have been signed onto since the 70s prevents such testing.",
                "They can’t even keep the doors on airplanes from falling out, what the fuck is this?",
                "Hopefully the missiles don't fall apart before reaching their targets.",
                "It's just gonna be one of their planes falling apart in the sky",
                "Government trying to supress the bad news and save the reputation lol",
                "Soo, the apocalypse is priced in already?",
                "That's what we definitely need - Boeing with nukes ![img](emote|t5_2th52|31226)",
                "WCGW?",
                "All this means is that the stock is on sale for future references. Could be a few years before seeing the stock doubled again",
                "'You only needed to blow the bloody doors off'",
                "#safe",
                "Did the nuclear missiles meet the DEI requisites?",
                "Yikes... Hoping for better bolts !",
                "Who thought giving modern day fuck up machine Boeing nukes was a good idea?",
                "No wonder we have a budget deficit. We have over 3,000 nuclear warheads. Enough to bomb every major city in our largest potential enemy's country five times over. If one fails, there are backups. I'd prefer some actual government services for my money. It just another bailout.",
                "Since their so good at making things that explode.",
                "Nuketah.",
                "So in space",
                "Fine with it, Utah is already tainted land. Can’t you feel the despair there? Creepy as hell.",
                "Watch out for falling missile doors",
                "Calls on radiation effects testing",
                "CEO getting more pay. LOL",
                "War. War never changes.",
                "Can't make a plane go wooosh lets have dem deal with nuclear power..",
                "Fact: they are good at crashing things. Win win",
                "Mcdonnell-Douglasssss puts!!!\n\nHaha",
                "I mean, I'd short that, cuz it's gotta come down sometime. Preferably on the target, but anyway",
                "Couldn't build a fucking civilian airliner to safety specs and now we're trusting these corporate fuckwits with WHAT?!?",
                "Boeing is very good at \n\nFilling out RFPs.\n\nActually delivering? Not so much.\n\nIt’s what has caused their meltdown. The entire organization it seems is focused on filling out govt forms really well. The best in the nation. World maybe. But, uh, not so great on delivering a product that works. Not the worst company, but I’ve seen better.",
                "Bro everything they make crashes to the ground so this is a literal bomb.  Bullish",
                "Boeing has aliens same with Lockheed Martin.",
                "The same Boeing that makes bombs that are being dropped on the children in Gaza?",
                "Great the DEIs who can't even make a stable airplane for travel now get to make nukes... This should go well.",
                "Fuckk that lol. Why are they winning something like this when they’ve shown that they do not value quality engineering? But hey, they probably paid off the right person. Fuck Boeing. That company shouldn’t exist for all of the bullshit that they’ve pulled recently.",
                "Lol",
                "Looks like Mormons will be soaking in more than they think.",
                "r/oddlyspecific"
            ],
            "post_time": "2024-04-03 19:19:22",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bvaf7r/boeing_wins_405m_to_test_nuclear_missile_systems/",
            "overall_sentiment_score": {
                "neg": 0.0,
                "pos": 0.18433333333333332,
                "neu": 0.8156666666666667,
                "compound": 0.34611666666666663
            },
            "overall_sentiment": "bullish",
            "num_comments": 341
        },
        {
            "post_title": "A whistleblower claims that Boeing’s 787 Dreamliner is flawed. The FAA is investigating | CNN Business",
            "body": "",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 60 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Calls on Smith and Wesson ",
                "Puts on whoever carries man’s life insurance.",
                "> “I literally saw people jumping on the pieces of the airplane to get them to align,” Salehpour said. “By jumping up and down, you’re deforming parts so that the holes align temporarily … and that’s not how you build an airplane.”\n\n\nLet's hope those bolts are nice and tight",
                "I wonder how they will commit suicide?",
                "The balls on the whistleblower. Damn, you have to respect that.",
                "I hope this guy has some serious protection",
                "Puts on this whistleblower ![img](emote|t5_2th52|4271)",
                "> Salehpour said Boeing retaliated against him after he raised another concern about the 787 and a different plane model.\n\n>The whistleblower complaint said he pointed out to management the existence of drilling issues with the 787, and was then “ignored and ultimately transferred out of the 787 program to the 777 program.”\n\nThe root cause of the safety issues at Boeing is the poor culture at the leadership level. How most leaders at Boeing still have their jobs is insane.",
                "Is suicide by Boeing a thing?",
                "How to make millions on boeing. 1. Buy a $1m life insurance policy. 2. Board a 787.",
                "Been flying Delta because they don’t have the 737 Max or 787.",
                "How do I short this individuals life?",
                "Damn and I was gonna take one to japan some point in the future😭",
                "Business as usual at boeing I see",
                "Fuck I think I'm flying to Hawaii from west coast on a 787.....",
                "Have we requested a wellness check on the guy yet?",
                "Bro boutta meet the queen",
                "Called it. This is a dumpster fire waiting to happen. Dude brave hope the feds give him protection. I'm actually nervous flying now 😔",
                "Rip whistleblower",
                "Balls on these blowers",
                "I kinda find it ironic to hear that BA stocks are falling....",
                "Oh. He ded.",
                "Then the FAA is flawed.",
                "I feel like anyone of us could have made the same claims and been right.",
                "Someone go investigate the faa",
                "Someone is bound and determined to buy some cheap Boeing stock",
                "There was a time, when the Titanic was a “Dreamliner”, too.",
                "Good good I was waiting for the dip level. It’s coming.",
                "In 2016 I took one to China and it randomly dropped like 20 feet out of nowhere. It was sus AF but didn't really think about it again until now.",
                "I’m traveling on a 10 hour 787 flight next month. Wish me luck",
                "At this point I’m buying calls, article after article and this thing won’t flinch…",
                "Hey ho, hey ho, the CEO has got to go",
                "Time to go all in.",
                "No shit it's flawed",
                "BA in 2 days- what whistleblower",
                "poor guy wont survive the week",
                "Hope this one survives.  All due respect.",
                "You think there insurance rates went up?",
                "The FAA is probably leaking the whistleblower's name to Boeing for some good ol wacking.",
                "The perpetrators will be sentenced to fly on a cross country Boeing economy flight at United Airlines 💀",
                "FAA bout to commit suicide",
                "He’ll be found dead in his home self inflicted several gunshot wounds to the back of the head",
                "Watch for suicide by 777.",
                "Boy better get to the safe house like it's Left 4 dead",
                "Boeing will split into two separate companies: Boeing Defense and Boeing Commercial Aviation",
                "Someone about to catch a case of glockoma",
                "Army grounding Boeing Chinook fleet after corrosion discovered in flight controls.",
                "Used to work for them. They lie to the government left and right. Blatant lies.",
                "Wow, what a miss! I thought they’ve murdered all of the whistleblowers.",
                "Unforseen suicide incoming",
                "coroner says it will be a suicide...",
                "If condoms had Boengs failure rate, we'd have 20billion people on this planet.",
                "Someone get this man some Kevlar",
                "He should be on suicide watch",
                "Well at least the board members received stock bonuses from the money they saved."
            ],
            "post_time": "2024-04-09 13:41:46",
            "post_url": "https://www.cnn.com/2024/04/09/business/boeing-787-whistleblower/index.html",
            "overall_sentiment_score": {
                "neg": 0.09300000000000001,
                "pos": 0.10566666666666667,
                "neu": 0.46799999999999997,
                "compound": -0.0034166666666666603
            },
            "overall_sentiment": "bearish",
            "num_comments": 139
        },
        {
            "post_title": "Boeing - don't buy this dip",
            "body": "Nothing has changed fundamentally for BA in last month and the selling is not done yet.  I have been watching the tape for last several months and it pulls back a little bit when news is slow or when they tease something a little bit positive, but then goes back flat.  It's a buy long term, but selling has to wind down first, which won't happen till the next set of heavy news cycle from the upcoming hearings and results.  Sit on this for next month or so, but keep an eye, once it breaks out, Boeing is gonna be hitting $230 (medium term) and $350 within 12-14 months.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 21 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Thank God I bought calls recently. I was worried till I saw this post\n\nEdit: market closed and I have no idea how OP got a hold on that many human sacrifices just so he could fuck my ass",
                "I bought at 225$ after the door incident and then bought the “dip” at 205$ … and here we are![img](emote|t5_2th52|4260)",
                "Someone bought long term puts huh?",
                "Until the culture changes back towards quality control  this will only get worse. Aircraft due to design requirements have some of the lowest factor of safeties out there. Small miscalculation or loss of quality control result in large issues. Apparently the board forgot that fact",
                "I don't care I'll buy 10 shares every Friday it's below 200. I appreciate their capacity for evil which is an often overlooked fundamental.\n\nhttps://preview.redd.it/6a3thyb7qasc1.jpeg?width=1080&format=pjpg&auto=webp&s=171ea1179d58d9825fd6d589b878488ef1dfd294",
                "I don't understand why anyone would think this piece of shit is going back near its ATH (from 2019 BTW, before the first max crash). \n\nEveryone here is just trying to jump on the next rocket and they're just desperately grasping at stuff that's been beaten down. \n\nThey have never been in a worse place reputation wise and that's not changing in less than 5-10 years. Their stock price has been stagnant for 4 years.",
                "Inverse wsb and buy this dip",
                "If they recycle their panels from the ones that fall off, it’s like adding another plane for free each quota. Bullish.",
                "Wait until after fbi raid",
                "I bought at 182 but dumped when it went up to 192. I mean if you are sitting on long term calls you'll be fine.",
                "My crystal crayons say 150 can be tested\n\nhttps://preview.redd.it/gbayfuno8bsc1.png?width=1080&format=pjpg&auto=webp&s=e514615e9cb0b9888bf1dc3870d6491aed4723d3",
                "fUnDaMeNtAlLy",
                "recent boeing ceos care more about and cost cutting and the stock price than proper engineering standards and quality controls.  until that changes, they will probably keep making mistakes.",
                "\"nothing has changed\" lol they switched CEO",
                "Of course I’m buying this dip. \n\nBuying more puts.",
                "I’m still holding from 2018, only down 52%![img](emote|t5_2th52|4640)",
                "That and they murder people",
                "Bought 60 shares when it dropped to 180$ and I don't see how it could go lower than that after last time's shitstorm.",
                "A waterfall is not a dip",
                "I got in at 180. I’ll buy more any place around that. Defense contracts are not taking a hit. They are still back ordered 7 years on planes. The only option is Airbus and they are 7 years booked out. It’s a buy for me and I’ll be  adding continually.",
                "The fact that they appointed another finance person as CEO tells you all you need to know",
                "My first foray into buying a beaten down company that “has absolutely no chance of going bankrupt” got in at $205. Sold at $197. If you are tempted to buy Boeing, the make money on Boeing being beaten down play is to buy Airbus and Rolls Royce. They make planes that don’t fall out of the sky or pop apart like Lego sets in the hands of autistic eight year olds, and engines for planes that don’t fall out of the sky or pop apart like Lego sets in the hands of autistic eight year olds respectively.",
                "Boeing's new slogan \"When one door closes another opens.\"",
                "100%, anyone that even farts on a Boeing plane generates news. Negativity is just wayyy too hot.",
                "Damn I was getting ready to buy, but I’ll hold off based on some wsb poster’s feelings about what the chart looks like.",
                "Allegedly they are installing a ceo work a background in engineering... historically this is actually a great move... business majors tend to be morons",
                "The decision to buy Boeing's dip should be carefully considered in light of the company's recent challenges and the potential for a rebound. Here's a summary of the information from the sources provided:\n\n1. **Challenges Faced by Boeing:** The challenges faced by Boeing in 2023 include issues with its defense business, margin pressure, costly charges, manufacturing quality issues, and delivery delays in the commercial airplanes division. These challenges may impact the company's financial objectives and stock attractiveness, raising concerns about its medium-term outlook.\n2. **Potential Rebound Factors:** Despite the recent decline in Boeing stock, there are several potential tailwinds that could support a rebound. The recent incident involving a 737 MAX 9 jet in an Alaska Air Group flight may have caused a spike in bearish sentiment, leading to the stock's decline. However, analysts at The Goldman Sachs Group have rolled out an outlook for 2024 that favors a breakout in the United States manufacturing sector, which could benefit Boeing. Additionally, the backlog of orders in the industry is beginning to rise, indicating increasing demand.\n3. **Valuation and Market Sentiment:** The recent decline in Boeing stock may have been overdone, as 100% of all the jet orders involve either 737 MAX 8 or MAX 10 jets, and none of these orders include MAX 9 jets. This suggests that the market may be bidding up the stock in anticipation of an earnings beat. The article also discusses the valuation of Boeing and Spirit AeroSystems, noting that both stocks are being punished for the faulty MAX 9 incident, despite the majority of their revenues coming from MAX 8 and 10 models. This could indicate that the market is willing to pay a premium for these stocks, suggesting a potential turnaround.",
                "I’m on a Boeing 787 (Qatar), was scheduled to depart London Gatwick at 1455 but was delayed at the top of the runway because one engine wasn’t turning on. We were parked remote from the terminal for about an hour before it was fixed but fuck me, this just adds to the narrative that things keep going wrong.",
                "Long puts @155 expiring after next EA",
                "it's opposite day so i'm buying calls. see you regards in the welfare line, but hopefully at the lambo dealership",
                "![img](emote|t5_2th52|31224)",
                "I’ll buy at $101",
                "[Still a ways to go](https://old.reddit.com/r/wallstreetbets/comments/1924qb3/alaska_airlines_has_found_some_loose_hardware_on/kh2sr6e/?context=3). We've only seen a couple minor incidents so far - symptoms. Wait until the big one before you buy.",
                "I can’t stress that the BA investment idea doesn’t make sense to me in the near or mid term except on hopium… ceo steps down but it’s the same bean counting that cause this mess… did the new CEO say anything about fixing the alarming issues… reworking policy on innovations and safety that was the core business model… even if it did… this house was slowly being torn down… the current work culture might take half a generation or decades to rebuild…  driving profits into better workflow and less on stock buy backs?",
                "I will buy the dip when a few 777 and 787 dip",
                "Bought in January after the window thought it couldnt get worser than losing a window mid air ![img](emote|t5_2th52|4260)",
                "Yup. Still have some criminal investigations and positions recently vacated to fill.",
                "Any news on the starliner?",
                "trust me bro",
                "Whew now its time to buy.",
                "At this point they need to be bought out",
                "Lol, because markets reflect reality of the health of a business?  This post truely belongs here.",
                "bought shares rn thanks to this post 👍🏼",
                "Calls it is then",
                "I already bought and sold calls for a profit, but thanks for your post",
                "They just have some slight issues with product quality",
                "And don't sit in an exit row on a Boeing plane.",
                "I bought and sold puts.  May dip into that pond again",
                "I'm buying 🙏🏻",
                "Why wouldn’t I buy this dip? It brings my average price down if I continuously buy every time they are exposed for being run by the poor eating aristocrats.",
                "Or, take that Boeing money your holding and dump it into Airbus.",
                "Well it’s good that you’ve been watching the tape for us",
                "Too late mother trucker!!!!!!!",
                "When is the movie due out?",
                "i dont expect much until this bosses of \"profit before everything else\" are again replaced with engineers, like it was 20y ago...",
                "long put @$150, just me?",
                "That’s it, I’m all fucking in.",
                "Trying to time the perfect buy will fuck you up. Better split the purchase in multiples within your expected timeline. So when were you thinking of buying in?",
                "Thanks for letting us know!",
                "The only time I lost money on stocks was when I listen to WSB. Guess it’s time to buy.",
                "Whistleblower suicided himself",
                "Wait until Lorne Michaels' puts print first, at least.",
                "The play is to buy $SPR (Spirit Aero) on buyout hopes, then re-enter $BA after.",
                "what do you say is a good entry point?\n\ni have no POS in BA so far, but FOMOing on getting some shares or calls..",
                "There is no scenario in which Boeing avoids bankruptcy",
                "The dip only keeps dipping",
                "soooooo put and short the dip GOT IT",
                "I bought ba at 180-185. LFG regards",
                "Boeing stock was 40$ in 2012 when then company was in far better shape all told. It deserves to be back there if not lower",
                "Does anyone reD books these days?",
                "Ever see that documentary about Boeing and how it used to be about quality back in the day and how under the new CEO quality went out the window for stock price? Twas quite interesting.",
                "Anthony Blinkins 747 was grouded due to mechanical issues.  Can't wait to see what they fuck up next!",
                "Cool, calls it is!",
                "No way in hell Boeing hits 350 in the next three years",
                "lol putting out no more than 9 planes per day in march. \nLet’s see how q1 earnings go. \n!banbet",
                "Sir yes sir!!!  Random Reddit user obeyed!",
                "Boeing hasn't been profitable since 2018.  Anyone buying shares or calls deserves to lose money.",
                "But should I buy the crash?",
                "Buy Embraer instead, they are going to outperform every airplane manufacturer in the next 5 years",
                "Dollar cost average into it, easy money.",
                "Everybody who's thinking it's rising today and deluding themselves, remember a few things: 1. Dead cat bounce, 2. The market is rising I don't know where it will go day to day, but there's another hearing coming and they will take a beating when that happens.",
                "lol... BA just got a contract to do the nukes out in Utah.\n\nRIP your puts",
                "Boeing will be fine. Too big to fail. \n\n\nThey are easily one of the most heavily protected companies in the US. It doesn't matter how many planes crash.\n\n\nAnd here's a thought. How is it Boeings fault the airplanes are falling apart? They are the manufacturer, not the customer. The airlines are responsible for maintaining their aircraft, not Boeing. Not Boeings fault Delta outsources their heavy maintenance checks to some dude wearing sandals in Mumbai or wherever. ",
                "See you all the way at $100",
                "Literally just picked up 50k in BA. This post just gave me a happy little tingle",
                "I'd rather be buying Spirit Aerosystems than Boeing.\n\nBoeing will need to undo a lot of bad decisions to win confidence back:  \nMove HQ back to Washington State  \nHire an engineer CEO  \nBring manufacturing back in house",
                "pretty happy with my 100 shares at $179.  Probably going to buy more.  Too big to fail, defense contractor and splits the market for airliners.  Order book extending a decade into the future.",
                "Ok",
                "They need to go to fucking 0. Fucking scared to death every time I get on a flight cause of them.",
                "This post is my buy signal. Thanks!",
                "Selling will never wind down. Boeing will finally get dismantled and shareholders will lose it all"
            ],
            "post_time": "2024-04-03 10:44:10",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1buxeu4/boeing_dont_buy_this_dip/",
            "overall_sentiment_score": {
                "neg": 0.00375,
                "pos": 0.11058333333333333,
                "neu": 0.8856666666666667,
                "compound": 0.16638333333333336
            },
            "overall_sentiment": "bullish",
            "num_comments": 229
        },
        {
            "post_title": "Boeing engine parts fall during flight. Puts will print.",
            "body": "https://www.nbcnews.com/news/us-news/engine-cover-southwest-airlines-plane-comes-takeoff-rcna146777\n\nMore problems now engine cover just flew off during flight. It just does not stop. Puts will print. Who knows what other surprise next week.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 361 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1bykrr4/boeing_engine_parts_fall_during_flight_puts_will/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Ah yes the ever famous line of engines made by Boeing.",
                "Boeing may not have a Quality problem but they do have a media problem. Bad news has arrived in steady flow for months now and isolated events will no longer be seen so.\n\nI have no position either way myself but I sure as hell ain't buying.",
                "Doubt it lol BA going to pop tomorrow calls!",
                "This has nothing to do with Boeing and everything to do with Southwest. That aircraft is almost 10 years old at this point according to its tail number.",
                "an engine cover isn't the same as an engine part.  it doesn't impact the a/c airworthiness.\n\nmost likely, the cover was not properly latched prior to flight.  \n\nthis is strictly a maintenance issue with swa, just like recent maintance issues with ua.\n\nsmart money will know better.  but then they may be a rare breed nowadays.",
                "You can still delete this brother",
                "More like a maintenance issue with Southwest Airlines instead of Boeing ",
                "Is this good or bad?",
                "Calls it is!",
                "Nope. Gonna moon. \n\nhttps://preview.redd.it/yhgkgiqha6tc1.jpeg?width=627&format=pjpg&auto=webp&s=92a0fde6f7506d83774168ee082ffb33f9924ddc",
                "Yeah no they won’t dude.",
                "I heard the CEO’s parts are falling off…",
                "Has nothing to do with it being Boeing. That’s a southwest maintenance issue, not the plane manufacturer. The media is really out to get Boeing as much as they can right now.",
                "That's on the airline's maintenance team, not Boeing.",
                "HAHA THOSE PUTS ARE SURE PRINTING FKING REGARD",
                "This sub doesnt understand nuance.  This is on maintenance, not Boeing",
                "Meh if another war breaks out boeing calls",
                "A cowling isn’t engine parts. If that’s your short thesis, then I knew you goons were deplorable. Calls on Boeing.",
                "Those engines were manufactured by CFM, not Boeing https://en.m.wikipedia.org/wiki/CFM_International_CFM56",
                "Priced in. Only deaths will negatively affect the price",
                "This doesn't look like good DD to me.\n\n^I ^am ^an ^LLM-powered ^bot. ^Please ^contact ^the ^moderators ^with ^concerns.",
                "Grabbing calls if it dips i think im ready",
                "I’m waiting for the day when the wings literally fall off and the plane just keeps flying to its destination perfectly fine. That will blow some minds at the 12 d chess move.",
                "Boeing doesnt make the engines.  I get the context but this feels like a maintenance issue.",
                "Sounds like a maintenance issue",
                "You spelt LUV wrong",
                "A cowling popping off isn’t the manufacturers fault",
                "You mean calls. Up is down at Boeing",
                "Priced in",
                "Lol",
                "The turnaround is going to melt faces.\n\nStill buying all the way down.",
                "Definitely something to watch.",
                "Boeing puts don't print, what kind of DD is this?",
                "where is the bottom with this? actually considering a buy... if they split military/commercial... I can see the stock price going up. The defense part of this still will hold it up, commercially its still worth something as the US wants to hold market share against the europoor airbus",
                "Seems like all major malfunctions happen on Sunday",
                "No mention of boeing, they must have paid a lot for that",
                "Made the Boeing Safety Inverse coin just for this reason. We’re printing as well.",
                "This is a southworst airline problem and not Boeing … just like when the engine exploded and sucked a passenger out…",
                "This is priced in, Boeing to the moon",
                "Lobbying finna wild out this election year",
                "I will ride with you. But just so you know, I’ve lost this before and I figure I will this time also",
                "Daily Dose of Boeing drama. They can’t even get a jet off the ground anymore. I’m under my covers in bed loading poots on BA right now",
                "Boeing has a DEI problem.",
                "shit happens",
                "I’m not CEO of Boeing yet guys. These engines and doors gonna keep falling until I get there!",
                "Boeing puts never play out the way you think they will. They're invincible as a company. They make endless series of fuck ups but continue to get billions of dollars from the government. It literally doesn't matter.",
                "It’s already priced in.",
                "thank you come again",
                "Bold strategy. Puts on $BA will kill your portfolio and possibly yourself.",
                "Are these things falling apart more now, or is it just being noticed more?",
                "Puts will print for the first like 2 hours of market open, then calls",
                "Just heard a podcast that Boeing has been having quality issues they even had an internal whistleblower but he died day before his trial for the Boeing whistleblowing.",
                "There are the 4/12 5 165 strike nickel scratch off specials gonna look at them Monday.",
                "[deleted]",
                " The question nobody is asking - did the door stayed intact this time?",
                "Is it a Boeing problem or is it a maintenance problem?",
                "Dammit my puts expired Friday!!!",
                "Calls on companies making parachutes!",
                "Priced in",
                "At this point any airplane problems is assumed and priced in. Calls it is.",
                "Business as usual - BA won’t flinch",
                "And did I buy 4/19 $200 call?!😓😅",
                "The engines are GE.\n\nhttps://apnews.com/article/southwest-airlines-plane-engine-fire-texas-c8ef3fdf15f431bfaa16f5aa6f061457#:~:text=The%20plane%20was%20a%20Boeing,Electric%20and%20France's%20Safran%20S.A.",
                "LOL. Market is irrational. Based on this news, Boeing will be up $3 since it shows their planes don't fall out of the sky with all this damage. Full port BA calls.",
                "[deleted]",
                "Shit airplanes are already priced in.",
                "Haha. You’re crazy. I once felt that way. No one gives a 💩. They literally assassinated the prime witness relating to these EXACT SAFETY CONCERNS and the stock barely moved…and that’s a HUGE tell about investors giving zero fucks about morality and ethics. Boeing will not be shooketh.",
                "Actually it's high tech engine cooling mechanism. Proprietary to Boeing. One time use only.",
                "Start making executives accountable for the failures of their company outside of their net worth temporarily dropping from 300m to 150m. You bet your ass safety and quality standards would dramatically increase."
            ],
            "post_time": "2024-04-07 18:58:54",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bykrr4/boeing_engine_parts_fall_during_flight_puts_will/",
            "overall_sentiment_score": {
                "neg": 0.01916666666666667,
                "pos": 0.10325000000000001,
                "neu": 0.8775833333333333,
                "compound": 0.081
            },
            "overall_sentiment": "bullish",
            "num_comments": 194
        },
        {
            "post_title": "DAL will shit the bed on earnings",
            "body": "Three reasons:\n\nLULU, TSLA, MCD all reported the consumer sharply pulling back recently. Does the average American board the plane to Miami when they can't afford their favorite butt shaped yoga pants, payment on a model 3, or the big breakfast meal? 🤔 \n\nThe Boeing blowouts were given extensive media coverage. Fear of flying is one if the most common phobias. Perhaps our friends in LA would rather just drive to Vegas rather than take the short flight simply cuz \"If it's Boeing, I'm not going\". \n\nOil prices are pissing through the rooftops. Delta has some mitigation to energy prices compared to other airlines, but it's still bad for them. Iran is apparently scheduled to attack Israel or US assets in the ME pretty soon too so that's probably not gonna help things there. Powell is also dead set on cutting rates even though manufacturing and employment are still experiencing a Renaissance, so that just stimulates energy demand even more.  \n\nBonus reason: DAL is near the price it was the last time it went back into the shit hole. \n\nI predict about a 5-6 dollar drop from the open on Monday. 4/12 put options at the money were about 1.40 on Friday's close. I rarely play earnings, but this setup seems pretty good so I'm gonna take a shot at it. \n\nRegards,\n\n-- Tim.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 734 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1biau1e/its_time_to_go_big_short_qqqspy/) [x](https://www.reddit.com/r/wallstreetbets/comments/1bhhx4e/nvda_think_like_a_hedge_fund/) [x](https://www.reddit.com/r/wallstreetbets/comments/uiom7r/im_shorting_oil_is_it_smart_or_stupid/) [x](https://www.reddit.com/r/wallstreetbets/comments/v80foo/jimmie_mcgill_china_straddle/) [x](https://www.reddit.com/r/wallstreetbets/comments/th5p7y/time_to_buy_china/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Calls.",
                "Delta has avoided flying infamously sketchy 737 equipment and captured some incremental market share because they want their passengers to arrive alive…",
                "This doesn't look like good DD to me.\n\n^I ^am ^an ^LLM-powered ^bot. ^Please ^contact ^the ^moderators ^with ^concerns.",
                "Just cuz u have to fly american doesnt mean the rest of us have to \n\nedit: also what that other guy said",
                "This sub is so fucking regarded",
                "DAL is a credit card company with planes. Movement will be based on forward guidance.",
                "What’s the date and time Iran is scheduled to attack Israel, Tim?",
                "You been on a delta flight lately? Jam packed",
                "Have you fucking gone anywhere?  All restaurants and planes and vacation spots are packed. Just cus no one wants another Tesla cus Elon is hella woke doesn’t mean the best ran airline isn’t eh country is going to take it. Btw delta has a total of ZERO 737 maxes\n\nOil went from like mid 70s to 86 I wouldn’t call\nThat through the rooftops. But it is something to watch.",
                "Read this and bought calls",
                "Are you going to do a ban-bet if you are so confident?",
                "This is goofy. Delta owns their own oil refinery. Oil prices going up means that Delta gets a better margin on fueling their planes versus other airlines. And the airlines negotiate fuel prices years in advance so short term spikes in prices aren't that big of a deal.",
                "Your DD is equating Delta to a high end apparel line? It could tank, but what are other companies in the same sector doing? Have you looked at the financials?",
                "My DAL flight today had like a whopping 11 people on it so maybe you're right.  Then again not many people traveling to Vail now that winter is over.",
                "I am going to start making these post. PANW is going to kill earnings Buy Palo alto cus everyone knows cyber attacks will happen and DUHH Nancy Pelosi.. i think we will see a nice move of 100+",
                "Devil advocate would simply say that the LULU , TSLA and MCD customers are not necessarily related to DAL customers. Better to compare apples with apples, for example if you tell me EXPE is a sign things are expected to slow down I am more convinced  : \n\nhttps://www.tradingview.com/news/reuters.com,2024:newsml_L3N3FB4UC:0-expedia-to-cut-about-1-500-jobs-globally-amid-moderating-travel-demand/?mobileapp_new=true\n\nNonetheless, good luck with your options!",
                "All the stocks you listed are getting killed b/c of China, not the consumer.   Every restaurant stock has been outperforming, and a huge chunk of the recent job growth has been in travel and hospitality.  Calls on Delta.",
                "get your moon boots ready boys",
                "I delta caters to the business class. Company travel mostly, jfk and atl to Europe is their major moneymaker. Along with west coast to Asia. \n\nThis is without talking about their non passenger services. \nDelta likes to do MRO services for other airlines, [sauce](https://news.delta.com/delta-techops-signs-225m-component-contracts-during-first-quarter-2023)\n\nOverhauling engines and parts brings in millions. For them. \n\nAlong with a lot of their fleet moving towards being an Airbus heavy fleet saves them from Boeings blunder. Ignoring the fact that they don’t fly the maxes yet anyways and won’t for a few years. \n\nAnd this is just coving the public info I’m allowed to talk about. Delta is stable. The fact that I’m getting calls from contract companies asking if I’m interested in doing contract work at the Atlanta airport both boldens my ego that I’m valuable and my confidence that since they need contractors in Atlanta, they aren’t struggling.\n\nAlso, look at the r/delta subreddit. People are complaining about how high ticket prices are.. while at the same time people are complaining about how full flights are. People are buying tickets.. \n\nSpirit on the other hand, spirit is struggling.",
                "Airports seem awfully full to me lately.   And prices of tickets way way up.",
                "Most of Delta’s domestic fleet are Airbus and that’s the bulk of their flights. The Boeing angle is as plus for them. Try doing your homework next time. ",
                "Stock up 2%",
                "DAL is up almost 3% today....",
                "The delta Amex is the real business",
                "![img](emote|t5_2th52|4271) ok . I get it calls on Oil stocks ![img](emote|t5_2th52|4276)",
                "Calls buddy lol",
                "Always a new stock, amazing how that scene from Wolf of Wallstreet still meaningful.",
                "‘Iran is scheduled to attack Israeli assets’\n\nOk, and? Where’s this schedule? Fucking Reddit degens>intelligence communities",
                "https://preview.redd.it/vn9fcgxg8atc1.png?width=1119&format=png&auto=webp&s=0b9e2612aa910ca9f2b0b2577e3fc89909e987d5",
                "Delta always poops the bed. Puts it is",
                "OP really thinks this is DD ![img](emote|t5_2th52|31226)",
                "DAL doesn't like shitty Boeing. I see calls in the future ",
                "RemindMe! Tomorrow",
                "IV being so high, I’d sell some IV and but it back when it drops (settles).",
                "[deleted]",
                "I prefer American Airlines, but looking forward to seeing what Delta does.",
                "Just buy oil stocks",
                "So people are pricing in it will go down and companies still need to fly employees around for it will buy calls",
                "To much yapping lately",
                ">MCD all reported the consumer sharply pulling back\n\nMCD is where people go to eat when they are broke and avoid when they have strong income.\n\n>Does the average American board the plane to Miami when they can't afford...\n\nFair point. Some people fly for family or work even during a pullback but tourism may slow down.\n\n>The Boeing blowouts were given extensive media coverage\n\nPeople are still flying, they're just avoiding certain Max jets.\n\n>Oil prices are pissing through the rooftops.\n\nJet fuel prices are high but still lower than they were in 2022. They're about the levels of 2011-2014.\n\n>DAL is near the price it was the last time it went back into the shit hole.\n\npast results are no guarantee of future returns.\n\nDoes any of this mean DAL share price will go up or down? No. I have no idea which way it will go. I have not looked into the company's fundamentals or \"word on the street\" so I have no idea. Good luck with your earnings play.",
                "skylounge got shitted on this year - Im big on calls cus customer loyalty does not equal short term guidance ;)",
                "This really depends on how much people prioritise certain things. Discretionary spending reductions are not linear.\n\nWhen times are good and the money is pouring in, a lot of people just aren't careful with money. They don't think \"why am I buying a £5K Omega when a £20 Casio keeps time as well as it?\", they just know there's plenty of money come in, so they buy the Omega. Or, they buy £70 Lululemon yoga pants instead of £20 Sports Direct ones. Is there any intrinsic difference as far as doing yoga between the two? Do those Lululemon ones include some mithril that means they last 4 times as long? No, You're just paying for a logo, for a fancier shop.\n\nBut there are cheaper luxuries, or things that offer a real benefit to people. Still luxuries, but people are going to cut the stupid stuff out before they cut that stuff. Like a family that does a flight at Thanksgiving to see Grandma is going to really try and retain that. They could not do it, but it's at the least discretionary spending.",
                "No position, no brains",
                "This post makes me feel great about my weekly calls. ",
                "My call are safe with this weak DD![img](emote|t5_2th52|4271)",
                "There may be some who fear flying right now, but I expect the $300 tix last year to be $500 this year because of the lower number of seats available. \n\nThis is caused by Boeing not delivering the expected planes for the Summer travel season. (United asked Pilots to take unpaid days off)",
                "I'm regarded and couldn't figure out why Iran was going to attack us in Maine (ME).\n\nInstructions unclear.  Puts on Lobstah'",
                "Delta is the most Airbus friendly major in the US... (I don't include JetBlue and Spirit as majors)",
                "Every time I see these posts I want buy calls but I’m broke",
                "Looks like this DD hit some turbulence",
                "DAL has their own oil refinery. Least sensitive airline to oil prices.",
                "In for a couple hundo -  bought **2** **DAL 4/12/2024 47.00 P**",
                "The last 4 or 5 earnings moves were all negative so we might be overdue for a positive move. OP you have not posted your positions.",
                "Delta is a premium airline and i refuse to fly with anyone else. I flew first class multiple times already this year and service is great. They own their own production for jet fuel as well. Delta could pop up on earnings for the first time in a long time.",
                "Calls it is",
                "This gard just literally posted 3 things the market has already accounted for and called it DD.",
                "I bought four calls 44.5C @ 3.15 today for Friday based on your post",
                "I m inversingthis",
                "Delta doesn’t have Boeing aircraft. Calls",
                "Woof",
                "I’ll do it with you.\n\nI usually say this when it comes to options and drugs.",
                "I took your advice, let's go crap earnings.",
                "Baked in. Earnings are already project to be down significantly"
            ],
            "post_time": "2024-04-07 21:01:59",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bynbcz/dal_will_shit_the_bed_on_earnings/",
            "overall_sentiment_score": {
                "neg": 0.1627843137254902,
                "pos": 0.057593837535014014,
                "neu": 0.7796218487394958,
                "compound": -0.1582565826330532
            },
            "overall_sentiment": "bearish",
            "num_comments": 180
        },
        {
            "post_title": "This week's game - a secular rally coming?",
            "body": "Earnings season is in full swing, and there are some easy pickings if you're on the long side. Here are some key projections:\n\n**CPI:**\n\n* CPI is likely to come in about 10 basis points under consensus expectations per my model.\n* Despite a hot jobs report and rising gas prices, productivity gains and a slowing pace of rent/rent equivalent increases will keep CPI in check.\n* This could put rate cuts back on the table.\n* If this thesis holds, expect the Russell 2000 (RUT) and Nasdaq-100 (QQQ) to rally.\n* Money draining from bonds to stocks this Wednesday.\n\n**Banks:**\n\n* JPM may kick off a bank rally.\n* If the inflation thesis holds, banks will start to look awfully cheap as earnings come through.\n\n**Tech Names:**\n\n* Not every stock will move up - track the fundamentals.\n* GOOG and AAPL are likely to outperform NVDA (this might be a hot take, but it doesn't say anything of long-term prospects, but the fact NVDA susceptible to some bumps, whereas AAPL negativity is peaking just as it has for GOOG).\n* META and NFLX looking pretty solid in the short term.\n* Look for unloved tech names that have been left behind due to the AI hype (e.g. AAPL).\n* Cybersecurity and IT services companies are expected to benefit.\n* Non-AI chip companies offer a safer downside play with potential upside.\n\n**Energy/Utilities:**\n\n* The oil sector is getting crowded, so target utilities and natural gas exposure instead.\n* A note on oil prices: $100 oil is not what it used to be.  US is relatively insulated from the negative impact due to its domestic production.  In fact, high oil and high stock markets can coexist.\n\n**Gold:**\n\n* Save yourselves, there are better plays. Goldbugs will not love this market into the year.  As inflation comes down, so will Gold.  Start taking the profits.\n\nThere may be some pockets to short, like Boeing or Tesla, but be cautious and use stop losses, as these names could get caught up in a broader market rally.  Time to buy, buy, buy!\n\nPS - Some have reached out for recommendations.  I noted some names that will be interesting to invest in here: [Today's game](https://www.reddit.com/r/wallstreetbets/comments/1bwh7qk/todays_game_strong_buy_signals_from_the_market/).  I am partial to cybersecurity as a sector, given it is likely to benefit from the overall trends I have noted.\n\n&#x200B;",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 88 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "What did your model say about the past couple CPI prints?",
                " Tsm this week and next get in and get out",
                "PAA calls are about to print",
                "What did you use to calibrate your mod, green crayons and 🐂💩 ?",
                "playing meta for the next three weeks",
                "Damn this dude has a model.",
                "GooG and Aapl outperform NVDA for what timeframe?",
                " We’re heading to earths core with a hot CPI",
                "you lost me at aapl, that piece of bum can’t go up like a limp duck",
                "CPI model! Wow! FED folks should take your model under consideration. They, the FED are too data dependent.",
                "This is the perfect cope post for my longs. Thank you.",
                "Energy/Utilities are getting primed for a Biden loss.\n\nIf he loses, I expect this sector will run and solar/wind will take a dump.",
                "When you say \"buy buy buy\" someone might ask your positions",
                "Energy too high, I don't see how CPI is coming in cool.",
                "Yeah... um... No.",
                " Looks like we're digging down to Earth's core with this hot CPI! ![img](emote|t5_2th52|4271)",
                "For Many reasons this post does Not seem genuine. Or maybe OP is delusional.\n\nA lot of wise inverses to do, I see in this post.",
                "Somewhere there is a tree that is barely hanging on, that tree has one job, to provide the oxygen specifically for you and only you ……… please go find that job and apologize to it for this post",
                "Per my wendys dumpster ![img](emote|t5_2th52|4267)",
                "BB, AAPL, GOog bag holder spotted",
                "Very well done sir…my compliments",
                " Thanks for the notes! ![img](emote|t5_2th52|4258)",
                "If your model is so good why don’t they just use that for their expectations?",
                "AMZN?!",
                "Appreciate the notes!",
                "![img](emote|t5_2th52|4271)",
                "This guy jas better models than Wallstreet!!",
                "lol cpi low and bonds killed…found the dingbat!!",
                "Share with us your so called model"
            ],
            "post_time": "2024-04-07 21:26:34",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bynsdw/this_weeks_game_a_secular_rally_coming/",
            "overall_sentiment_score": {
                "neg": 0.013078431372549021,
                "pos": 0.13601960784313724,
                "neu": 0.8509019607843138,
                "compound": 0.1750588235294118
            },
            "overall_sentiment": "bullish",
            "num_comments": 69
        },
        {
            "post_title": "PUTS ON BOEING PUTS ON BOEING",
            "body": "",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "I will wait to see what The Moon says",
                "not sure what hes saying but my guess would be call on boeing?",
                "priced in already",
                "I was picturing blinken literally having to sky dive out of a failing boeing",
                "Nobody is gonna buy puts on Boeing you have to be a huge fking idiot to do that. Ha go against the us government in a us government run market good fking luck bud.![img](emote|t5_2th52|4271)",
                "https://preview.redd.it/tfz7q8r6zdsc1.png?width=1080&format=pjpg&auto=webp&s=71a496d7c6604fb8b19f59340a64da4e28dbcd94",
                "CALLS ON BOING ALL IN",
                "Calls it is",
                "Time for calls",
                "Rip Israel salas-Rodriguez reporter for the Sun.",
                "!banbet BA 175.00 22d",
                "Puts on puts is a double negative, so calls it is",
                "Sometimes I think all we have to do to win is think like Homer Simpson",
                "So even the USAF is shit at maintaining it's 747s"
            ],
            "post_time": "2024-04-03 18:08:33",
            "post_url": "https://www.the-sun.com/news/10978725/antony-blinkens-boeing-plane-mechanical-failure/amp/",
            "overall_sentiment_score": {
                "neg": 0.0,
                "pos": 0.10566666666666667,
                "neu": 0.561,
                "compound": 0.15548333333333333
            },
            "overall_sentiment": "bullish",
            "num_comments": 31
        },
        {
            "post_title": "Delta Airlines ($DAL) ER DD",
            "body": "Hi Regards,\n\nI will not be answering messages, but will comment here and there as my time allows. I have more DD, but I do not have the energy to post an essay. Remember, this is not financial advice, but a quick, high level DD, for the majority of people who play options based on emotion or trends, or to hedge their plays (as options were initially intended for).\n\nI may scalp some or I may not. I may post if I do, I may not. If you can afford to hold, hold your options play post earnings. Remember, the day of **EARNINGS** is when the CPI, Inflation Rate, FOMC Minutes are announced.\n\nMy position: $48.5C\n\nThe other guy u/[GarthbrooksXV](https://www.reddit.com/user/GarthbrooksXV/) posted that DAL will 'shit the bed' based on a variety of incorrect data.\n\n  \nHere is why I believe Delta Airlines ($DAL) will go up a modest \\~8% to 12% post earnings:\n\n1. On their previous earnings, they expected a capacity increase between 3% to 5%\n\n2. Full year 2024 EPS expected to be $6 to $7 a share\n\n3. Most of Delta's aircrafts are NOT the Boeing 737 Max. Yes, they have ordered them, but the deliveries are delayed.\n\n4. Those who fly Delta, are aware that this is a top airline. They are a part of the Sky Alliance Team, and most of their airline partnerships charge far more than their competitors (on average).\n\n5. As u/[GarthbrooksXV](https://www.reddit.com/user/GarthbrooksXV/) mentioned a 'Bonus Reason.' Here is mine:\n\nBonus Reason: During AMEX's previous earnings call, the CFO responded to questions with the following responses regarding Delta Airlines ($DAL):\n\n***\"So, I don't -- you know, we'll see whether it's the beginning of a trend or whether it's a data point. But we keep seeing, you know, a lot of strength and, you know, the partnership we have with Delta is working very, very well. Originations, you know, of new cards are very strong. And, you know, cardmembers decided to redeem a bit less in Q4 with airline tickets than they did in the past.\"***\n\n***\"Yeah. So, the Delta product is still going very, very strong. The total billing growth on the Delta product for the full year was up 15%, and we originating a lot of new cards as well. My comment about their, you know, softness in terms of Q4, hard to say whether it's the beginning of a trend or whether it's just a blip.***\n\n***Time will tell. But it's still going very, very strong. And the engagement with the partner -- you know, with the partner is very strong. The partnership is going strong.***\n\n***So, I don't see any softness there at all. And, you know, I will say as well that their credit quality of those new cardmembers remain very strong. I made comments about it's one of the fastest-growing segment on the loan side. and it comes with very strong performance.***\n\n***People who travel a lot and who fly a lot tend to have strong credit quality, and we see that on the loan side, on the spend side, on the origination side. So, you know, I'm not worried about that at this stage.\"***\n\nThis is nothing against the other user, I am just stating my DD since in my opinion, I believe his had a lot of incorrect information.\n\nThis is NOT financial advice.\n\nBest Regards,\n\nBaymax\n\n*How Would You Rate Your Pain?*",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 465 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "Calls for sure all the atl homeboys still flying delta",
                "What’s your exp on that call",
                "Thanks fam, however I learned my lesson and will say tomorrow before closing. ![img](emote|t5_2th52|31224)",
                "Just got call for 48.5 inshallah you right",
                "Delta just changed their loyalty program from miles flown to dollars spent on the Amex, that’s why I bought calls.",
                "This is BS. Normally see a WSB DD and just inverse. But now there’s both sides suggested. What’s a regard supposed to do?",
                "Why do you believe that we could see an 8% - 12% move on ER when if you look at the historical data that would be a very rare occurrence. I’m thinking a straddle/strangle would be the play if it went 8%+ in either direction.",
                "I’m entering 4/19 $50c tomorrow on a dip. This earnings beat, next earnings shit tbh",
                "I am holding 15 contracts of 48.5C exp 4/12. I scalped 185 of them before market close for a quick 20% gain.",
                "Just placed an order for 27 call contracts for 4/12 at $47. Placed after hours today so hopefully it goes through tomorrow at open\n\nhttps://preview.redd.it/br6tjkfdwctc1.jpeg?width=536&format=pjpg&auto=webp&s=1cb7cfa61977d2d98c93386bdd54d9e48bf54f46",
                "I’m in for calls as well but do you think inflation report Wednesday morning will have an affect on price movement for earnings ?",
                "I’ll buy some calls and screw all your calls ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
                "It's all about guidance and they're going to blow it out of the water because they're booked well into September on almost all their international flights. People are traveling like crazy, business travel is back to pre-covid levels, and Paris Olympics in July and they're the biggest U.S. airline to fly to Paris.",
                "Delta calls on earnings is sure shot this time.",
                "I'm in for 19APR24 52C",
                "Long on delta especially if spirit says they are supposed to be profitable this year. \n\nWatching this closely still have some bags from the save merger",
                "Delta is up 12% last month. Rosy earnings is already priced in. What will move the stock is not the earnings but their guidance. Their 737 Max order is already delayed and that could impact their forward guidance. I would stay away from Delta.",
                "What do you think about?\nSTZ call\nFAST call",
                "My confirmation bias supports this DD.",
                "Post proof",
                "Last time I flew Delta, they had to reassemble the break right before pushback. Puts",
                "My 46 and 42 puts are gonna print. Thanks OP :)",
                "Got in this morning, overpaid, averaged down, tendies tomorrow???",
                "Currently in FC on a delta flight, I wouldn’t invest in them. Service is in the toilet the last few years.",
                "Travel industry as a whole is down. There’s been a pullback happening post Covid now that the pent up demand has passed. The days of the entire corporate workforce working from anywhere are almost gone with many implementing a hybrid work programs with RTO. Several major travel stocks recently took a hit and I don’t think DAL is immune to our current macroeconomic conditions.",
                "Doesn’t delta use Boeing planes? And aren’t Boeing planes falling apart?  …..yeah going to $100."
            ],
            "post_time": "2024-04-08 15:40:22",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1bzabys/delta_airlines_dal_er_dd/",
            "overall_sentiment_score": {
                "neg": 0.006350000000000001,
                "pos": 0.15338333333333334,
                "neu": 0.8402833333333334,
                "compound": 0.23268250000000001
            },
            "overall_sentiment": "bullish",
            "num_comments": 57
        },
        {
            "post_title": "This is why Boeing puts next week could provide a great payout next week.",
            "body": "Alright all, this is going to be DD on the short side, but still juicy.\n\nSo today it came to light that the FAA is investigating Boeing, not because of additional issues related to the 737 Max, but rather due to a whistleblower coming forth and raising concerns about the 787 Dreamliner AND the 777 where not only does the whistleblower claim that Boeing took shortcuts, but that he was also retaliated against for raising the issues.\n\nBut let's say that you knew that already. So why could puts be the strategy for next week? Because next week Boeing will be testifying in front of congress (well, a subcommittee in the Senate, but still!). They will be asked about all of the issues that have popped up with the 737 for the past few years and now also the reports regarding the 787 and 777. There is absolutely no good news that can come out next week to redeem them short of another company purchasing Boeing and that is almost impossible to happen as Boeing itself is at no risk of being in financial trouble any time soon even with all the issues they have. While there have been plenty of negative news coming out for Boeing lately, we are guaranteed that no positive news can come out any time soon and as we all know, the market loves to react to news.\n\nTL;DR: Puts on Boeing for next week because finance bros ruined the company.",
            "comments": [
                "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 60 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
                "https://preview.redd.it/sx1axj9ufitc1.jpeg?width=1080&format=pjpg&auto=webp&s=1fbdf8782da457acc90eee5dd0a00add38a4ee60\n\nI will continue to buy 10 shares every Friday it's below 200 happy to bring my average down.\n\nAlso positions or ![img](emote|t5_2th52|31224)",
                "show your positions? screenshots would be preferred",
                "If you don’t have skin in the game no one cares. Post positions",
                "Thanks for the thoughts. When is this testifying scheduled to take place? Thanks again",
                "Anything boeing puts on either gets blown off or set on fire.",
                "Boeing killed a man and their stock is fine.",
                "Uh, this is priced in, but it may keep going down.  I’m surprised more people on the assembly line haven’t come forward about quality control shortcuts; there are so many employees.  Also, the people questioning Boeing this week are people whose campaigns they donate to, etc., so there will be bluster, but it’s just bread and circuses",
                "Position or keep it to yourself",
                "Ban this loser",
                "I bought a long call.",
                "You’re weeks late.",
                "You gunna post your position or what?",
                "I am shorting BA. What are the odds another whistleblower will have an accident....with a gun to the mouth?"
            ],
            "post_time": "2024-04-09 13:53:45",
            "post_url": "https://www.reddit.com/r/wallstreetbets/comments/1c01ghn/this_is_why_boeing_puts_next_week_could_provide_a/",
            "overall_sentiment_score": {
                "neg": 0.0155,
                "pos": 0.19663333333333333,
                "neu": 0.7878666666666666,
                "compound": 0.3275133333333334
            },
            "overall_sentiment": "bullish",
            "num_comments": 20
        }
    ],
    "items": 14,
    "ticker": "BA",
    "num_posts": 17
}